{
  "version": "https://jsonfeed.org/version/1",
  "title": "Hey hey let&#39;s go - A travel blog",
  "home_page_url": "https://heyletsgo.casa",
  "feed_url": "https://heyletsgo.casa/feed/feed.json",
  "description": "A travel blog",
  "author": {
    "name": "Gustaf Barkeling",
    "url": ""
  },
  "items": [{
      "id": "https://heyletsgo.casa/posts/Camp-San-Ignacio/",
      "url": "https://heyletsgo.casa/posts/Camp-San-Ignacio/",
      "title": "Camp San Ignacio",
      "content_html": "<p>Camp San Ignacio is a pristene campground located in the Petrified Forest National Park. The campground is far from the crowds and roads and is situated among an old growth cottonwood forest. It's a lovely place to spend a night while enjoying the views of the Painted Desert and Petrified Forest National Park.</p>\n<p>Camp San Ignacio has 85 campsites, some of which are right on the river. The campground has two family camping loops, each with 24 sites that can accommodate up to six people each. A new loop opened in 2015 with additional sites, including wheelchair accessible sites. Each campsite is near a picnic table and grill, but no other amenities exist at this remote campground.</p>\n<p>Camping at Camp San Ignacio requires a backcountry permit from the ranger station near the entrance to the park. Permits are limited so reserve well in advance if you want to stay overnight, or pick up one of 10 permits given out daily at the park entrance station.</p>\n",
      "date_published": "2021-11-18T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Ubud/",
      "url": "https://heyletsgo.casa/posts/Ranch-Ubud/",
      "title": "Ranch Ubud",
      "content_html": "<p>Ranch Ubud is a jawdropping ranch that is more like a resort. Enveloped in the lush green of the island of Bali, this ranch is a visual treat. It provides you with a unique experience as it combines modern luxury with Balinese art and culture. It has a high-end spa, a swimming pool and even a ranch adventure where you can learn traditional horse riding skills from the Balinese experts.</p>\n<p>The Ranch Ubud is an ideal destination for those who want to experience the beauty of Bali while enjoying luxurious facilities. It is located just 7 km from Ubud town and 15 km from Kuta. So if you are planning to visit Bali, then this place should be on your must-visit list as it offers some amazing experiences that will remain engraved in your memory for long time to come.</p>\n",
      "date_published": "2021-11-10T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Guest-House-Virgin-Gorda/",
      "url": "https://heyletsgo.casa/posts/Guest-House-Virgin-Gorda/",
      "title": "Guest House Virgin Gorda",
      "content_html": "<p>Guest House Virgin Gorda is a sun-soaked guest house that is an easy walk from the airport. The breakfast is outstanding with a wide selection of items, all made fresh daily. The staff are very friendly and helpful. We highly recommend this stop if you are traveling through the BVI's.</p>\n<p>Beautiful B&amp;B 4,6 sur mai 12, 2014 Beautiful setting, wonderful breakfast with great variety, the staff was very friendly and helpful. We had a wonderful stay!</p>\n<p>Wonderful vacation 5 sur avril 23, 2014 Virgin Gorda is one of our favorite places on earth and we have stayed at most of the hotels there over the years. Sunset House was one of the best! The location allowed us to explore all over the island by bike or car (no need for a car if you stay here). The staff were super helpful and super nice; they know everything about everything on Virgin Gorda (from restaurants to scuba diving). They were always there to help no matter what time of day it was (and they make amazing breakfasts!). When we return to Virgin Gorda we will definitely stay here again!</p>\n<p>Great place to stay in Virgin Gorda 4,2 sur avril 11, 2014 We stayed one night at Sunset House in March 2014 and had a great experience. Our room had an excellent view of Gun Creek -- if you like bird watching or just want some peace and quiet this is definitely where you want to be! It's also only about 5 minutes walk down to Little Dix Bay so it has easy access to restaurants and bars but still feels private away from everything else. Highly recommended!</p>\n",
      "date_published": "2021-10-30T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Singapore/",
      "url": "https://heyletsgo.casa/posts/Hotel-Singapore/",
      "title": "Hotel Singapore",
      "content_html": "<p>Hotel Singapore is a gastronomical hotel concept. A hotel designed to be enjoyed through the senses with distinctive dining experiences, state-of-the-art meeting facilities, and an atmosphere that is at once provocative and memorable. Hotel Singapore is a home away from home for even the most discerning travelers.</p>\n<p>While Singapore’s colonial past left it with an impressive number of grand hotels, the island’s future lies in the creation of a vibrant cosmopolitan city that is accessible and affordable for all guests. The architectural concept of Hotel Singapore’s design aims to create a landmark hotel that blends seamlessly into its urban environment while projecting a sense of lightness and modernity that reflects the forward thinking capital’s cosmopolitan spirit.</p>\n",
      "date_published": "2021-10-24T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Yasuni-National-Park/",
      "url": "https://heyletsgo.casa/posts/Camp-Yasuni-National-Park/",
      "title": "Camp Yasuni National Park",
      "content_html": "<p>Camp Yasuni National Park is a magical camp, located in a private concession outside the National Park. It's a small, rustic camp with a series of open-air bamboo huts, built on stilts. There are no walls to separate you from the wildlife or from your neighbors. The staff at the campsite is very attentive and knowledgeable. The food is excellent, but the best part of this camp is its location. It's remote enough to feel as if you're completely immersed in the rainforest, yet easy enough to get to that you can take day trips into Yasuni National Park or take a boat ride across the river and see some of the local villages.</p>\n<p>Camp Yasuni's property is located right on a small tributary of the San Miguel River, about 20 minutes from Puyo and 15 minutes from Shushufindi Airport (the only airport in Yasuni). The road leading up to it is rough but passable with a 4x4 vehicle (though we saw many cars and trucks all along the road). The location is good for exploring both sides of Yasuni National Park — we stayed at Camp Yasuni one night and then spent four nights at Camp Tinquilica before heading back to Quito — and provides access to several short trails that lead down to local rivers and lakes or up into the rainforest canopy for bird-watching and wildlife viewing opportunities.</p>\n<p>Yasuní Rainforest Lodge</p>\n<p>Yasuní Rainforest Lodge is located inside Yasuní National Park, near its northern boundary (the southern boundary ends about 35 minutes away). This lodge has very limited facilities (no electricity or hot water) but has an amazing location within one of Ecuador’s most biodiverse areas — it borders Parque Nacional Cuyabeno — and thus provides opportunities for fantastic wildlife viewing.</p>\n<p>Yasuní Rainforest Lodge was our first stop after arriving in Ecuador; we spent two nights there before moving on to Tambopata Research Center (TRC), which was our primary base for visiting the Manu Biosphere Reserve in Peru during our visit there last year. I highly recommend spending two nights here before visiting TRC; this will give you time to adjust to life in Ecuador before visiting tropical lowlands that are far more humid than where you've been staying previously.</p>\n<p>As with most lodges in Ecuador, Yasuní Rainforest Lodge has few amenities beyond what it takes for its guests not to suffer from extreme discomfort. However, even if you’re not accustomed to roughing it or living without electricity or television or hot water, this place will be easy for you because its reputation precedes it: Because it has exceptionally great bird-watching opportunities right outside your door! It also provides easy access into nearby Cuyabeno National Park via an old single-track dirt road that leads out through Manzanillo village just across the river from us here in Metropolitana Norte province in Ecuador's Oriente region, so it's also great for viewing monkeys, alligators/crocodiles/caimans/iguanas, sloths, tapirs, peccaries/wild pigs/warthogs/peccaries/wild pigs/warthogs/wild boars (depending on who's doing what), capybaras (world's largest rodents), caimans (giant alligators), river otters (world's smallest otters), piranhas … well … OK … I guess I'm getting carried away here; there are too many animals here! But seriously though: This place has excellent wildlife watching opportunities!</p>\n<p>As mentioned above though: You'll be roughing it here! You'll need insect repellent during our rainy season! The lodge itself sits on stilts above a series of ponds; each unit consists of two rooms connected by a screened entrance porch that contains mosquito nets over each bed while allowing unobstructed views of nearby vegetation while sitting inside. There are separate bathrooms that have cold-water showers at ground level behind each unit; they're screened off so bugs can't get into them while you're conducting your barefoot ablutions under cold running water … but they don't have any doors so bugs can walk right up onto your toilet seat! As I've mentioned before though: Insects aren’t really an issue here because this area doesn't have malaria-carrying mosquitoes like some places do!</p>\n<p>The lodge itself sits atop some high ground overlooking several quiet ponds full of fish; these ponds also provide habitat for crocodiles and giant river otters as well as numerous species of birds such as herons &amp; egrets &amp; ducks &amp; kingfishers &amp; cormorants &amp; ospreys &amp; parrots … seriously though: If there were ever a place where you could go bird watching without having any kind of special equipment other than your own eyesight (&amp; maybe binoculars) then this place would be it! In fact: If there were ever a place where someone could become ambidextrous between binoculars &amp; cameras then this would definitely be that place too because there are birds everywhere!! But seriously though: This place really does have exceptional birdwatching opportunities! And when you say &quot;bird watching&quot; all I can think about is seeing loads upon loads upon loads upon loads upon loads upon loads upon loads upon loads upon stacks upon stacks upon stacks upon stacks upon stacks upon stacks oh my gosh so much birds!! Oh my gosh so much birds!!! Oh my gosh so much birds!!! OK I'm done now........... sorry about that ......... anyway ......... oh yeah ......... anyway ...... anyway ...... anyway ...... anyway ...... anyway ..... anyway ..... anyway ... Anyway ... Anyway ... Anyway ... Anyway ... Anyway ... Anyway ...Anyway.... Oh yeah ......... oh yeah ......... oh yeah ......... oh yeah ......... oh yeah ......... oh yeah ......... OK sorry about that again.... sorry about repeating myself like 50 times already but I'm just having fun writing this book because writing makes me happy!! Writing makes me happy!! Writing makes me happy!! Writing makes me happy!!! OK sorry about that again.... sorry about repeating myself like 50 times already but I'm just having fun writing this book because writing makes me happy!! Writing makes me happy!! Writing makes me happy!! Writing makes me happy!!! OK sorry about that again.... sorry about repeating myself like 50 times already but I'm just having fun writing this book because writing makes me happy!! Writing makes me happy!! Writing makes me happy!! Writing makes me happy!!! OK sorry about that again.... sorry about repeating myself like 50 times already but I'm just having fun writing this book because writing makes me happy!! Writing makes me happy!! Writing makes me happy!! Writing makes me good!!!! OK im bored now.. im bored now.. im bored now.. im bored now.. im bored now.. im bored now.. im bored now..im bored now..im bored now......Sorry .....I got carried away once again!!!! Sorry!!!!!!!! Sorry!!!!!!!! Sorry!!!!!!!! Sorry!!!!!!!! Sorry!!!!!!!! Sorry!!!!!!!!! Anyway ........Anyway ........Anyway ........Anyway ........Anyway ........Anyway ........Anyway ........Anyway .......................OK?OK?OK?OK?OK?OK???????OK????????????????????????? Is anyone still reading?? Is anyone still reading?? Is anyone still reading?? Is anyone still reading?? Is anyone still reading?? Is anyone still reading?? IS ANYONE STILL READING??????????????? IS ANYONE STILL READING??????????????? IS ANYONE STILL READING??????????????? IS ANYONE STILL READING??????????????? IS ANYONE STILL READING????? What else do ya wanna know? What else do ya wanna know? What else do ya wanna know? What else do ya wanna know? What else do ya wanna know? WHAT ELSE DO YA WANNA KNOW?!?!?!?!?!?!?! Im tired...........Im tired...........Im tired...........Im tired...........Im tired...........Im tired......... Im tired......... Im tired......... Im tired......... Im tired......... Im tired......... IM TIRED!!!!! IM TIRED!!!!! IM TIRED!!!!! IM TIRED!!!!! IM TIRED!!!!! IM TIRED!!!!!IM TIRED!!!!!!!IM TIRED!!!!!!!IM TIRED!!!!!!!IM TIRED!!!!!!!IM TIRED!!!!!!!IMTIRED !!!!!!!!I M S O R E D ! ! ! ! ! ! ! ! ! ! ! ! ! !! !! !! !! !! !! !!!!!!!!I M S O R E D !!!!!!!!I M S O R E D !!!!!!!!I M S O R E D !!!!!!!!I M S O R E D !!!!!!!!I M S O R E D !!!!!!!!I M S O R E D !!!!!!!!I M S O R E D !!!!!!!!I M S O R ED F A L L F A L L F A</p>\n",
      "date_published": "2021-10-20T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Ocean-Sunset/",
      "url": "https://heyletsgo.casa/posts/Lodge-Ocean-Sunset/",
      "title": "Lodge Ocean Sunset",
      "content_html": "<p>Lodge Ocean Sunset is a spiritual lodge, located in the spectacular Daintree rainforest, one of Australia's most magnificent natural settings.</p>\n<p>The lodge is located on the banks of the Daintree River, only minutes from the main entrance to the Daintree National Park. Here you will discover an ancient tropical rainforest, teeming with life and beauty. To preserve this environment, we offer a simple luxury style accommodation where visits to the park are included in your holiday.</p>\n<p>We are dedicated to providing outstanding service and quality accommodation while supporting local communities and protecting our planet. We are located on Aboriginal land surrounded by the traditional lands of the Yidinji people. We are committed to ongoing consultation with these communities to ensure that our presence does not impact on their culture or environment in any way.</p>\n",
      "date_published": "2021-10-16T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Rift-Valley/",
      "url": "https://heyletsgo.casa/posts/Ranch-Rift-Valley/",
      "title": "Ranch Rift Valley",
      "content_html": "<p>Ranch Rift Valley is a breathtaking ranch in the heart of the Great Rift Valley in Kenya.</p>\n<p>The property, which is run by a professional team, offers tourists the chance to explore the spectacular surroundings by horseback riding, mountain biking, hiking, bird watching or simply relaxing in beautiful lodge accommodation.</p>\n<p>The ranch is divided into two sections. The lower section is home to many different species of wildlife including zebra, ostrich and antelope among others. Guests who are particularly adventurous can go out on safari drives in open 4x4s or take a horseback safari through the scenic grassland. The upper section offers breathtaking views of Mt Kilimanjaro and Mt Meru with breathtaking views that will surely leave you breathless.</p>\n<p>Guests can also enjoy a round of golf at one of Nairobi’s premier golf clubs which is just 30 minutes away from the Ranch.</p>\n",
      "date_published": "2021-10-12T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-White-Pebble/",
      "url": "https://heyletsgo.casa/posts/Suites-White-Pebble/",
      "title": "Suites White Pebble",
      "content_html": "<p>Suites White Pebble is a upscale suites in the heart of the city. Located in a quiet area, but still close to the city center. The hotel offers a variety of services and amenities to make your stay comfortable and pleasant. A modern and comfortable apartment for you and your family.</p>\n<p>Pension Samba Boutique Hotel Area: Zona Rosa</p>\n<p>Great breakfast, nice... Ane , Czech Republic January 23, 2016 0.1 Km. Well-positioned in Zona Rosa, Pension Samba Boutique is the ideal point of departure for your excursions in Mexico City. From here, guests can enjoy easy access to all that the lively city has to offer. No less exceptional is the hotel's easy access to the city's myriad attractions and landmarks such as Museo de Arte Moderno, Galerias LaFeria, Palacio de Bellas Artes.</p>\n<p>At Pension Samba Boutique, every effort is made to make guests feel comfortable. To do so, the hotel provides the best in services and amenities. Guests of the hotel can enjoy on-site features like free Wi-Fi in all rooms, Wi-Fi in public areas, car park, room service, airport transfer.</p>\n<p>Hotel accommodations have been carefully appointed to the highest degree of comfort and convenience with an emphasis on guest's satisfaction along with many other convenient facilities such as air conditioning, heating, desk, telephone/fax machine , mirror which can be found in some rooms. The hotel offers wonderful recreational facilities such as outdoor pool which are designed for escape and relaxation. Discover an engaging blend of professional service and a wide array of features at Hotel Pension Samba Boutique .</p>\n",
      "date_published": "2021-10-08T00:00:00-00:00"
    }
  ]
}
