{
  "version": "https://jsonfeed.org/version/1",
  "title": "A travel blog",
  "home_page_url": "https://heyletsgo.casa",
  "feed_url": "https://heyletsgo.casa/feed/feed.json",
  "description": "A travel blog",
  "author": {
    "name": "Gustaf Barkeling",
    "url": ""
  },
  "items": [{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Grosso/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Grosso/",
      "title": "Ecolodge Grosso",
      "content_html": "<p><img src=\"../../img/jungle/pexels-greg-galas-3647545.jpg\" alt=\"Ecolodge Grosso\"></p>\n<p>Ecolodge Grosso is a romantic ecolodge that provides lovely rooms at affordable prices in Mato Grosso do Sul. It is located in the small town of Santa Rita, which is about 90 km south of Campo Grande, the capital of the Brazilian state. The lodge is surrounded by lush tropical rainforest, which makes it close to flora and fauna.</p>\n<p>The ecolodge has 10 double rooms with private bathrooms, six double rooms with shared bathroom. The shared bathroom are located next to the common area where you can have breakfast or watch TV. Each room has a private balcony with hammock and view to lush tropical rainforest.</p>\n<p>The ecolodge also has a pool, solarium, restaurant and wi-fi internet access at the common area only. Guests can enjoy activities like boat tours through Pantanal wetlands, fishing tours or visiting region’s main attractions like Chapada dos Guimarães National Park while staying at the ecolodge.</p>\n",
      "date_published": "2021-11-18T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Pacuare/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Pacuare/",
      "title": "Ecolodge Pacuare",
      "content_html": "<p><img src=\"../../img/jungle/pexels-teguh-sugi-6121916.jpg\" alt=\"Ecolodge Pacuare\"></p>\n<p>Ecolodge Pacuare is a spiritual ecolodge, set in the remote forests of the Pacuare River, near Manuel Antonio National Park. Located in the jungle, the lodge offers a variety of activities including white water rafting, hiking, canopy tours, bird watching and yoga.</p>\n<p>Enjoy an intimate lodging option at The Bullfrog Resort located on the beach in Playa Matapalo. The small resort offers affordable accommodations with a selection of private rooms, dorms and camping available. Relax on your own private deck overlooking the ocean or enjoy music in the bar area.</p>\n<p>The Green Iguana is located on Playa Matapalo and offers beachfront cabins nestled among lush tropical gardens with views of the ocean. Walk down to Playa Matapalo for swimming, snorkeling or build a sandcastle at sunset.</p>\n",
      "date_published": "2021-11-14T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-di-Positano/",
      "url": "https://heyletsgo.casa/posts/Suites-di-Positano/",
      "title": "Suites di Positano",
      "content_html": "<p><img src=\"../../img/city/pexels-jonathan-petersson-528427.jpg\" alt=\"Suites di Positano\"></p>\n<p>The breakfast buffet was wonderful - a great selection of fresh fruit, pastries, meats and cheeses. One of our party did not eat fish so a special meal for him was prepared - a simple pasta dish with vegetables. The location is fantastic - just steps from the sea and all the restaurants in Positano. The staff were very friendly and helpful. Wifi worked well in all areas of the hotel. There is a shuttle bus that takes guests to Amalfi or to Ravello if you want to go there but we just walked everywhere we wanted to go from Positano - it is all within walking distance! We loved this hotel!</p>\n",
      "date_published": "2021-11-10T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Puerto-Maldonado/",
      "url": "https://heyletsgo.casa/posts/Ranch-Puerto-Maldonado/",
      "title": "Ranch Puerto Maldonado",
      "content_html": "<p><img src=\"../../img/jungle/pexels-mike-1174108.jpg\" alt=\"Ranch Puerto Maldonado\"></p>\n<p>Ranch Puerto Maldonado is a romantic ranch located along the Urubamba River, only a few minutes from the town of Puerto Maldonado and around 40 kilometers from Cusco. It offers a wide range of services: tours and daytrips to the jungle and rivers, birdwatching, horseback riding, hiking among colorful birds and butterflies.</p>\n<p>El Lomito Lodge El Lomito Lodge is a family owned lodge located in the Madre de Dios region near Manu National Park. The lodge is surrounded by primary rain forest with spectacular bird watching opportunities as well as other wildlife viewing possibilities such as monkeys, caimans and other animals.</p>\n<p>The Jungle lodges are located in Manu National Park close to the city of Cusco. These lodges enjoy a high level of comfort along with a personalized service that will make your stay a memorable one. These lodges have been designed to preserve the natural beauty of the rainforest while providing all necessary comforts for travelers.</p>\n",
      "date_published": "2021-10-30T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-Yasuni-National-Park/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-Yasuni-National-Park/",
      "title": "Safari Camp Yasuni National Park",
      "content_html": "<p><img src=\"../../img/jungle/pexels-pixabay-514232.jpg\" alt=\"Safari Camp Yasuni National Park\"></p>\n<p>Safari Camp Yasuni National Park is a jawdropping safari camp inside Yasuní National Park and home to a spa and a spectacular view over the river and the rainforest.</p>\n<p>Yasuní National Park is home to some of the most unique species on the planet after it was declared a biosphere reserve in 1979. It’s also home to some of the most diverse ecosystems on Earth, such as flooded forests, marshes, savannahs and cloud forests.</p>\n<p>Yasuni National Park is one of the most biodiverse places on Earth, with 75% of flora and fauna found nowhere else in the world. The park also has one of Latin America’s largest populations of indigenous peoples who have lived in the area for several centuries. There are over 16 different ethnic groups represented throughout this vast expanse of wilderness.</p>\n<p>The park is also considered an important center for sustainable development by protecting both culture and nature. The park boasts an impressive array of mammals including tapir, jaguar, giant anteater, manatee, capybara, giant river otter, pacarana (a large rodent), three-toed sloth and armadillo among many others. As well as being an excellent place to see birds including macaws, toucans, hummingbirds and trogons you can also spot caiman lizards among other reptiles here.</p>\n",
      "date_published": "2021-10-26T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Resort-Aqua-Beach/",
      "url": "https://heyletsgo.casa/posts/Resort-Aqua-Beach/",
      "title": "Resort Aqua Beach",
      "content_html": "<p><img src=\"../../img/beach/pexels-asad-photo-maldives-3155661(1).jpg\" alt=\"Resort Aqua Beach\"></p>\n<p>Resort Aqua Beach is a jawdropping resort situated in the heart of Koh Rong mainland. The resort has 6 bungalows, all are individual and unique. You can stay in a luxury bungalow or in a traditional Cambodian house, depending on your style.</p>\n<p>The bungalows are built on stilts, in case of high tide it can be very cool. If you decide to stay in one of the wooden houses, the bathroom is located outside (only separated by a small wall).</p>\n<p>If you like to travel with your family or friends, every bungalow has its own terrace with sun loungers and hammocks. The resort has 3 swimming pools, 2 of them also used for swimming lessons for children. There is also an activity pool with water slides and pool games for adults and children alike.</p>\n<p>The restaurant serves local Cambodian dishes but also western food like pancakes or pasta. You can also ask for different kinds of cocktails at the bar located near the 3rd swimming pool. For all people who want to party till late there is a bar with large sofas &amp; pillow beds with ambient music right next to the beach!</p>\n",
      "date_published": "2021-10-12T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Singapore/",
      "url": "https://heyletsgo.casa/posts/Inn-Singapore/",
      "title": "Inn Singapore",
      "content_html": "<p><img src=\"../../img/city/pexels-aleksandar-pasaric-2067048.jpg\" alt=\"Inn Singapore\"></p>\n<p>Inn Singapore is a charming inn with a great location, a very friendly staff and comfortable rooms. This is a gem of a find in Singapore, and one of our favorite places to stay.</p>\n<p>Inn Singapore is located at 30 Victoria Street, near the mouth of the Singapore River. The hotel has a great location with excellent access to transportation, shopping, dining and attractions. The hotel is also close to the financial district and the Raffles Place MRT station so you can easily get around town.</p>\n<p>The hotel offers free parking for guests arriving by car at the hotel’s lot or valet parking services for $25 per night (subject to availability). The hotel also has free WiFi access throughout the property.</p>\n<p>The inn has 40 well-appointed guest rooms that are all equipped with air conditioning, cable television, tea / coffee making facilities, an electronic safe and several other amenities including hair dryers and showers with bathtubs. There are non-smoking rooms available as well as rooms with connecting doors for families traveling together (enquire when booking). Some of the rooms have balconies but if not there are shared balconies on each floor overlooking Victoria Street that guests may use freely. The shared balconies are perfect for enjoying an evening cocktail or playing cards with friends! Check out these photos of some of Inn Singapore’s rooms:</p>\n",
      "date_published": "2021-09-26T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Naladhu/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Naladhu/",
      "title": "Ecolodge Naladhu",
      "content_html": "<p><img src=\"../../img/plains/pexels-amy-chung-672706.jpg\" alt=\"Ecolodge Naladhu\"></p>\n<p>Ecolodge Naladhu is a ecological ecolodge located in the dense jungle of the Sibambe bay, on the coast of the Golfo Dulce, at only 25 minutes from Puerto Jiménez. The ecolodge is located just 5 minutes by boat from Nosara. You can enjoy beautiful views of the beach and Nosara river. The lodge is ecological and offers accommodations for up to 14 people in 4 cabins with private bathrooms, hot water, ceiling fans and hammocks where you can enjoy an unforgettable experience in nature. There is a restaurant-bar with ocean view where you can taste local dishes and beverages made with healthy ingredients such as coconut water and organic coffee. On site we have a good variety of tropical plants and trees that contribute to create a unique ecosystem that allows us to learn about nature and its importance in our environment. Our goal is to provide our clients with experiences that allow them to connect with nature and learn about its importance for their health and well-being while enjoying their vacation in Costa Rica.</p>\n",
      "date_published": "2021-09-18T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-Kensington/",
      "url": "https://heyletsgo.casa/posts/Chateau-Kensington/",
      "title": "Chateau Kensington",
      "content_html": "<p><img src=\"../../img/city/pexels-ahmed-abdelaziz-453201.jpg\" alt=\"Chateau Kensington\"></p>\n<p>Chateau Kensington is a gastronomical Chateau located in the 1st arrondissement of Paris. The restaurant was given one star by the Michelin Guide in both 2010. Gilles Epié is the head chef patron, since 2008. The restaurant is located in the heart of the old town of Paris, on Rue d'Alger. It is close to Place d'Italie, which has hosted numerous French Presidents during their terms of office.</p>\n<p>The decor follows classical lines with richly decorated ceilings and gilded mirrors that give an elegant impression. The menu offers classic French cuisine with modern twists, using fresh produce from France's finest regions and restaurants located around the world; for example, foie gras from Strasbourg and lobster from Maine (USA).</p>\n",
      "date_published": "2021-09-06T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-Providence/",
      "url": "https://heyletsgo.casa/posts/Suites-Providence/",
      "title": "Suites Providence",
      "content_html": "<p><img src=\"../../img/city/pexels-ahmed-abdelaziz-453201.jpg\" alt=\"Suites Providence\"></p>\n<p>Suites Providence is a breathtaking suites hotel located in the heart of Providence’s financial district. The hotel offers a variety of spacious, luxurious suites for guests to choose from, as well as a variety of culinary delights from the on-site restaurant, The Biltmore Grill. With fabulous views of downtown Providence and the river, The Renaissance Suites Providence is the perfect place to stay while exploring all that this exciting city has to offer.</p>\n",
      "date_published": "2021-08-13T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Naladhu/",
      "url": "https://heyletsgo.casa/posts/Camp-Naladhu/",
      "title": "Camp Naladhu",
      "content_html": "<p><img src=\"../../img/plains/pexels-rodnae-productions-7894962.jpg\" alt=\"Camp Naladhu\"></p>\n<p>Camp Naladhu is a remote camp site in the Baliem Valley on the north side of the Baliem Valley, which is about 55 km north of Wamena. The name Naladhu means &quot;Land of the Waterlilies&quot; in local Dani language. As its name implies, Naladhu is a beautiful place surrounded by an abundance of water, where water lilies grow naturally. Naladhu is situated on the bank of the Baliem River with a length of about 3.5 km. The river runs through many rapids and is surrounded by cliffs on both sides. The waters are clear and clean providing good fishing for native people living nearby.</p>\n<p>Naladhu was established as a remote clinic for STF (Student Team Foundation) in 1981 with the help of Australian volunteers, Mr Fred Mogg and Mrs Val Hoddle who were working at STF at that time. Their aim was to provide basic health care services to local people living around Baliem Valley whom were very isolated even from other villages in that valley due to high peaks surrounding it. There were no roads or any other transportation way there at that time, but only footpaths to cross over mountains and valleys which caused difficulties to reach there especially during rainy season when pathways were covered with mud or washed away by torrents carried down by heavy rains which would normally last for 3–4 months per year.</p>\n<p>The first clinic was built using bamboo with earth flooring and grass roofing with total area less than 10 square meters without electricity or running water. Most basic health care services could be provided there such as minor surgery (e.g.: removal teeth), childbirth assistance, vaccinations for children, physiotherapy sessions etc. During 1981-1985 when Mr Mogg and Mrs Hoddle worked there they also provided schools for local children because previous schools in that area had been either destroyed during fighting between Dani tribes or because they had moved out due to fighting during tribal wars between Dani tribes over traditional territories or hunting grounds since 1970s up to 1990s when tribal wars ceased in Papua Province due to government's efforts under special autonomy program in Papua Province implemented since 2001–2004 after East Timor became independent from Indonesia in 1999 . Today there are four schools around Baliem Valley operated by STF (Student Team Foundation).</p>\n<p>When Mr Mogg left STF (Student Team Foundation) in 1985 he gave responsibility for running this clinic to Dr Peter Ward who was one of volunteers working at this clinic until 1991 when he returned back home . Dr Peter Ward also built another small clinic next to his house using concrete flooring and roof made out of metal sheeting replacing earlier structure built by Mr Mogg using bamboo . He also built two separate shelters next his house where patients could stay overnight if needed because it took 2 days walking along mountain paths from this remote clinic up until down stream Wamena town where main road ends . This remote clinic was finally closed down in 1992 after Dr Ward left Papua New Guinea back home after spending almost 20 years working with STF (Student Team Foundation) .</p>\n",
      "date_published": "2021-07-20T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Ocean-Sunset/",
      "url": "https://heyletsgo.casa/posts/Lodge-Ocean-Sunset/",
      "title": "Lodge Ocean Sunset",
      "content_html": "<p><img src=\"../../img/beach/pexels-flickr-149622.jpg\" alt=\"Lodge Ocean Sunset\"></p>\n<p>Lodge Ocean Sunset is a breathtaking lodge in Plettenberg Bay situated in the heart of the Garden Route and the Indian Ocean. The Lodge is a sought-after wedding venue and has hosted famous people such as Sir Alec Issacs, Sir David Frost and Sir Trevor McDonald.</p>\n<p>The lodge is also popular for conferences, retreats and other corporate functions. It has hosted many business conferences such as the South African Tourism Conference and many small business start-ups have been born at the lodge. The beautiful surroundings at Ocean Sunset make it a sought-after venue for weddings and special occasions.</p>\n<p>The Lodge is situated on an expansive 3 000 square meter property with stunning views of the ocean, mountains, indigenous forests, sunsets and sunrises.</p>\n",
      "date_published": "2021-07-12T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Madikew-Game-Reserve/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Madikew-Game-Reserve/",
      "title": "Ecolodge Madikew Game Reserve",
      "content_html": "<p><img src=\"../../img/plains/pexels-pixabay-259411.jpg\" alt=\"Ecolodge Madikew Game Reserve\"></p>\n<p>Ecolodge Madikew Game Reserve is a charming ecolodge that has 9 thatched cottages, each with private bathroom. They are very comfortable and beautifully decorated.</p>\n<p>Madikwe Game Reserve is one of South Africa’s newest game reserves. It was created in 2000 by the WWF and Wilderness Safaris, to provide a home for the magnificent black rhino population that was being decimated by poachers. There are now over 800 rhinos living in Madikwe, making it the largest black rhino sanctuary in Africa.</p>\n<p>Madikwe is also home to many other species of Southern African wildlife, including the Big Five – lion, leopard, buffalo, elephant and rhino – as well as cheetah, wild dog, giraffe and more than 400 bird species.</p>\n<p>The landscape is stunning with rolling hills covered by bushveld trees and wildlife roaming freely across the plains. The reserve is surrounded by a 9km electric fence to prevent poachers from entering the area. This makes it much safer to walk around during game drives. There are seven different types of lodges within Madikwe Game Reserve: 3 Wilderness lodges (two of which are located inside Madikwe National Park) and 4 Wilderness tented camps (all located outside Madikwe National Park).</p>\n",
      "date_published": "2021-07-04T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Mashpi/",
      "url": "https://heyletsgo.casa/posts/Ranch-Mashpi/",
      "title": "Ranch Mashpi",
      "content_html": "<p><img src=\"../../img/jungle/pexels-greg-galas-2092828.jpg\" alt=\"Ranch Mashpi\"></p>\n<p>Ranch Mashpi is a pristene ranch and recreation property located in the heart of the Otavalo Valley. Enjoy breathtaking views of the majestic Imbabura and Rumiñahui volcanoes from your private patio.</p>\n<p>This 14 hectare (34 acre) ranch is located in Manzanita, a small village in the Otavalo Valley - one of Ecuador's most enjoyable and popular travel locations. This secluded location provides you with access to some of Ecuador's best hiking, horseback riding, bird watching, coffee tours, hot spring spas and more!</p>\n<p>A number of local artisans have made their home here in Manzanita - so you can shop for unique crafts right outside your door. A full day can be spent visiting rustic artisan shops in nearby Quilotoa Village or Latacunga City.</p>\n<p>The area also boasts several organic farms that are excellent for tours or just to pick up fresh produce. The Eloisa Organic Farm is just a short 15 minute drive from the ranch. A visit there will leave you with a greater knowledge of how food is grown in Ecuador which will make you appreciate your meal all that much more!</p>\n",
      "date_published": "2021-06-12T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-San-Ignacio/",
      "url": "https://heyletsgo.casa/posts/Lodge-San-Ignacio/",
      "title": "Lodge San Ignacio",
      "content_html": "<p><img src=\"../../img/jungle/pexels-arthouse-studio-4534200.jpg\" alt=\"Lodge San Ignacio\"></p>\n<p>Lodge San Ignacio is a charming lodge that sits on the edge of a lake, just a short drive from the main plaza. The lodge has a restaurant that serves an excellent breakfast. The rooms are simple and comfortable, and come with a private bath. For those wanting more privacy, there are three lakeside cabins available.</p>\n<p>Although it's not as luxurious as some of the other hotels in town, this small hotel is immaculately clean and features large rooms with comfortable beds and cable TV. Rooms include mini-fridges and coffeemakers, but there is no hot water for showers – you have to wait until the next day to take one.</p>\n<p>The biggest hotel in town has spacious, high-ceilinged rooms with wooden floors and great views of nearby Laguna de Istmina from the upper floors. Rooms are decorated with folk art and include coffeemakers, mini-fridges and cable TV – none have hot water for showers or sinks though (there's only cold). It has an inviting pool area surrounded by greenery with hammocks to lounge in – perfect for lazing around after a day of exploring nearby sites like Xplor or Xcaret (located about 30km away).</p>\n<p>About 2km north of town off Hwy 307 (the road to Río Lagartos), this remote tropical retreat is located on 5 hectares of private reserve bordering Laguna de Istmina National Wildlife Refuge – ideal for birding! Three spacious cabins have hardwood floors, balconies facing the lake side or gardens, fully equipped kitchens and screened windows so you can sleep peacefully even when jungle critters are chirping outside your door at night!</p>\n<p>There are several basic sodas near the main plaza offering cheap eats such as tortillas (filled tortillas), sandwiches, eggs or hamburgers for about Q15 each – they're open during daylight hours only though so keep that in mind if you're looking to grab dinner late at night here. There are several upscale restaurants downtown serving international cuisine as well as local fare including seafood ranging from Q100 to Q150 per dish – expect higher prices during festivals like Semana Santa (Easter Week), Fiestas Patronales (in September) or other special events when all hotels increase their rates by 50%. Drinking establishments range from rough cantinas where locals drink beer out of buckets off tables made out of tree branches used as benches to upscale places where foreigners can order fancy cocktails for upwards of Q150 each!</p>\n<p>Information</p>\n<p>Banco de Costa RicaBANK ATM(Calle del Sol)ATM accepting Visa cards only but no changes given on withdrawal made using ATMs linked to international networks like Cirrus or Plus etc.. No fee charged though so still better than changing money at home before coming here! There’s another ATM located inside Banco Nacional near the main plaza where both domestic cards like Visa Plus work fine too without any fee changes made using them either…excellent news!</p>\n",
      "date_published": "2021-06-06T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Guest-House-Naladhu/",
      "url": "https://heyletsgo.casa/posts/Guest-House-Naladhu/",
      "title": "Guest House Naladhu",
      "content_html": "<p><img src=\"../../img/beach/pexels-anfisa-eremina-3887909.jpg\" alt=\"Guest House Naladhu\"></p>\n<p>Guest House Naladhu is a charming guest house located in a quiet street in the Colombo 7 suburb of Wellawatte. The guest house is an oasis of tranquility and comfort and provides the perfect setting for a comfortable and relaxing holiday.</p>\n<p>A wide range of rooms are available including deluxe, super deluxe and penthouse suites. All rooms feature air conditioning, cable television, ceiling fans and private bathrooms with hot and cold running water.</p>\n<p>The facilities at the guest house include a multi-cuisine restaurant, a bar, tea lounge and book corner where guests can relax with a book or newspaper after a long day exploring the city.</p>\n",
      "date_published": "2021-05-27T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Osa-Peninsula/",
      "url": "https://heyletsgo.casa/posts/Camp-Osa-Peninsula/",
      "title": "Camp Osa Peninsula",
      "content_html": "<p><img src=\"../../img/jungle/pexels-greg-galas-3647545.jpg\" alt=\"Camp Osa Peninsula\"></p>\n<p>Camp Osa Peninsula is a spiritual camp featuring the 5-star Osa Peninsula Costa Rica Retreat &amp; Spa Retreat, which has been recognized as one of the leading eco-friendly destinations in Costa Rica. Camp Osa is a place where you can experience the magic of this country, where you will have plenty of time to unwind and discover yourself in one of the most beautiful places on earth.</p>\n<p>The Eco-Retreats are all located inside the boundaries of Corcovado National Park, which means that you will have easy access to pristine forests and beaches.</p>\n<p>This is exactly what makes the Osa Peninsula so special. It is home to an incredible variety of wildlife, including whales, dolphins, monkeys and endangered species such as the tapir and jaguar. Other activities available at Camp Osa include bird watching, horseback riding, hiking and kayaking. The area offers incredible biodiversity and unique ecosystems such as mangrove swamps and rainforests with giant trees like Mahogany and Ironwood trees.</p>\n",
      "date_published": "2021-05-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Ocean-View/",
      "url": "https://heyletsgo.casa/posts/Hotel-Ocean-View/",
      "title": "Hotel Ocean View",
      "content_html": "<p><img src=\"../../img/beach/pexels-flickr-149622.jpg\" alt=\"Hotel Ocean View\"></p>\n<p>Hotel Ocean View is a spiritual hotel. The architecture is pure Zen. It is very beautiful and comfortable.</p>\n<p>The hotel has a big garden with a meditation center, where you can learn Yoga and meditate every day.</p>\n<p>They serve different kinds of food all day long, but it is not a vegetarian hotel. You can be vegetarian only if you ask for it. They have a lot of vegetarian options, but they don’t promote this diet, they just serve what you order.</p>\n<p>Tourists from all over the world come to the hotel to practice yoga and meditation for a week or two before going back to their country or city. People love this place because it has the perfect environment to do their practices, and eat well too!</p>\n<p>I stayed at Hotel Ocean View for 7 days and I loved it! This place is very relaxing and peaceful. Perfect for those who want to rest deeply and slow down before going back to their stressful lives in cities or countries far away from India.</p>\n",
      "date_published": "2021-05-15T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Paracas/",
      "url": "https://heyletsgo.casa/posts/Ranch-Paracas/",
      "title": "Ranch Paracas",
      "content_html": "<p><img src=\"../../img/plains/pexels-antony-trivet-6053075.jpg\" alt=\"Ranch Paracas\"></p>\n<p>Ranch Paracas is a spiritual ranch, where guests are invited to connect with the spiritual energy of the location, in order to have a more meaningful experience.</p>\n<p>Paracas offers the opportunity to have an authentic experience in one of South America's most beautiful places, in a natural setting that includes wild horses, stunning sunsets and the bright stars of the Southern Hemisphere.</p>\n",
      "date_published": "2021-05-13T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Zighy-Bay/",
      "url": "https://heyletsgo.casa/posts/Hotel-Zighy-Bay/",
      "title": "Hotel Zighy Bay",
      "content_html": "<p><img src=\"../../img/beach/pexels-brent-keane-1702372.jpg\" alt=\"Hotel Zighy Bay\"></p>\n<p>Hotel Zighy Bay is a jawdropping hotel in Dubai, United Arab Emirates. The hotel is located at an exclusive location along the shores of the Arabian Gulf in the Emirate of Ras Al Khaimah, UAE.</p>\n<p>The hotel is a 5-star resort that offers excellent facilities and services to all guests. The hotel was opened in 2009. The Zighy Bay Hotel has 199 guestrooms including 6 beach suites which are made of teak wood with private pools overlooking the Gulf of Oman.</p>\n<p>This luxury resort features nine restaurants serving both international and Arabic cuisines. There are also several bars in the property for guests to enjoy drinks with their friends or family members in a pleasant atmosphere. The hotel also features two swimming pools, three tennis courts, fitness center, sauna, steam room and many other entertainment facilities for you to enjoy your holiday in the best way possible.</p>\n",
      "date_published": "2021-05-11T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Mashpi/",
      "url": "https://heyletsgo.casa/posts/Inn-Mashpi/",
      "title": "Inn Mashpi",
      "content_html": "<p><img src=\"../../img/plains/pexels-rachel-claire-4577147.jpg\" alt=\"Inn Mashpi\"></p>\n<p>Inn Mashpi is a isolated inn in the mountains in the south-east of Bolivia. It was built in 1932 by the Belgian missionary Père Jean-Pierre Dejairagre, who wanted to help improve living conditions for local people.</p>\n<p>When Père Dejairagre died in 1964, he was buried at Mashpi under his favourite tree. His grave is marked by a simple cross that stands outside the chapel at Mashpi. Père Dejairagre is well remembered and his legacy lives on through the work of local people, who continue to run the inn to this day.</p>\n",
      "date_published": "2021-05-09T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Guest-House-Sandy-Dunes/",
      "url": "https://heyletsgo.casa/posts/Guest-House-Sandy-Dunes/",
      "title": "Guest House Sandy Dunes",
      "content_html": "<p><img src=\"../../img/beach/pexels-vlad-3894868.jpg\" alt=\"Guest House Sandy Dunes\"></p>\n<p>Guest House Sandy Dunes is a romantic guest house with a stunning view of the Atlantic Ocean. It is located at the most northern tip of Barbados, in one of the most beautiful settings in the Caribbean.</p>\n<p>The property is situated on a cliff with views of Sandy Bay Beach stretching across to Saint Lawrence Gap. It is only 3 minutes from Bridgetown.</p>\n<p>The cottage has an open-plan living area with comfortable sofas, a dining table and fully equipped kitchen with granite counter tops. There are two bedrooms, one with a queen-size bed, and the other with twin beds. The master bedroom has an ensuite bathroom with bathtub and shower unit. There are two private covered verandas with rocking chairs overlooking the sea, perfect for watching spectacular sunrises or enjoying romantic sunsets.</p>\n",
      "date_published": "2021-04-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-St.-Barts/",
      "url": "https://heyletsgo.casa/posts/Hotel-St.-Barts/",
      "title": "Hotel St Barts",
      "content_html": "<p><img src=\"../../img/beach/pexels-alexandr-podvalny-319892.jpg\" alt=\"Hotel St Barts\"></p>\n<p>Hotel St Barts is a jawdropping hotel in St Barts that is famous for its white facade, which is perfectly picture perfect on the beach. The hotel has 82 rooms that feature luxury amenities like Frette linens, Italian marble baths, and designer toiletries. Guests are welcomed with a fresh flower arrangement in the guest rooms. Hotel St Barts also has an infinity pool where guests can enjoy a swim with magnificent views of the Caribbean.</p>\n<p>Le Royal is located in Saint Barthélemy, which is one of the most luxurious hotels in Saint Barts with stunning rooms that overlook the beach or gardens. The hotel also features two swimming pools overlooking the ocean, an outdoor spa with beauty treatments, and a private helipad to whisk guests off to other private islands for lunch or dinner.</p>\n<p>Saint Barth is an incredible island destination with stunning beaches and luxury hotels that are perfect for honeymoons or romantic getaways.</p>\n",
      "date_published": "2021-04-15T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-Marylebone/",
      "url": "https://heyletsgo.casa/posts/Chateau-Marylebone/",
      "title": "Chateau Marylebone",
      "content_html": "<p><img src=\"../../img/city/pexels-kai-pilger-591383.jpg\" alt=\"Chateau Marylebone\"></p>\n<p>Chateau Marylebone is a rustic Chateau in the hills of Doheney, near Avignon in the southern France. The Chateau is surrounded by a park with ponds and fountains.</p>\n<p>The Chateau was built between 1695 and 1700 as a hunting lodge for Jacques-Armand de Coligny, marquis de Villars (1653–1730) and his wife Louise de Marillac (1660–1733). The building was designed by the architect Pierre Malingre (1664–1735). The Marquis de Villars was at that time governor of the Dauphiné province and captain of the Royal Guards of Louis XIV.</p>\n<p>After donations from its owners, Marylebone passed to John Aubrey, an English antiquary who wrote &quot;Brief Lives&quot; for his friends. Aubrey named it &quot;Mary Le Bone&quot;. He made various improvements to the Chateau including the construction of a chapel which still stands today.</p>\n<p>Marylebone passed soon after to Marie Madeleine d’Hautefort, Viscomtess d’Auvergne, who left it to her nephew Louis-Henri-Maximilien Comte de Beauvilliers. Beauvilliers had been appointed Ambassador to Great Britain in 1751. He was also known for his work on Frederick II of Prussia's war propaganda in which he supported British policy during the Seven Years' War. In 1773 he sold Marylebone to Henry Fox, 1st Baron Holland (1705–74), then British ambassador at St Petersburg, who entertained there many notable guests including Tsarina Elizabeth I of Russia in 1773. After Holland's death Marylebone passed to his son Charles James Fox (1749–1806), statesman and political leader known as &quot;the English Cicero&quot;. It was during this period that Horace Walpole wrote his famous novel &quot;The Castle of Otranto&quot; based on Marylebone's interior decoration. Charles James Fox sold it in 1793 to Thomas Pitt who lived there before returning it to Lady Holland after he wounded her son at a duel. She then sold it again in 1810 after Fox's death to Sir John Malcolm (1769–1833) Military engineer and diplomatist whose father had retired there after returning from India where he had served as governor of Bombay between 1781 and 1784. Malcolm used it as a country retreat for his family until 1820 when he sold it again after returning from St Petersburg where he had served as ambassador until 1811 under Tsar Lady Holland's son Lord Holland (Charles James Fox's grandson) after whom today's Holland House is named). His daughter Anne Isabella Malcolm (1803-1844) died at Marylebone at age 41 without having married or having children which caused its sale by her brother Lord Abercorn Malcolm who died there in 1844 aged 52 soon after its purchase by William Craven Earl Craven (1800–1870).<br>\nCraven lived there mostly with his wife Louise Elisabeth de Meheux d'Albert de Luynes whom he married 3 years earlier but still paid visits each year with their children from their respective spouses:</p>\n",
      "date_published": "2021-04-07T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-Providence/",
      "url": "https://heyletsgo.casa/posts/Chateau-Providence/",
      "title": "Chateau Providence",
      "content_html": "<p><img src=\"../../img/city/pexels-zachary-debottis-1838640.jpg\" alt=\"Chateau Providence\"></p>\n<p>Chateau Providence is a sophisticated Chateau with a rich history, situated in the heart of the city of Bordeaux.</p>\n<p>Built in 1796, it was once home to the Famous Bordeaux wine merchant Paul Pontallier. Since its inception, the Chateau has been through many hands and has hosted Councils, Royalty and international VIP’s. Today it plays host to Corporate Events, Weddings &amp; Private Parties.</p>\n<p>Providence offers a unique atmosphere that is both elegant and intimate, providing clients with flexibility in terms of their event style whilst incorporating modern facilities and outstanding service. Our experienced team will help you create an unforgettable experience for all your guests while allowing you to enjoy your special day.</p>\n",
      "date_published": "2021-04-01T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Guest-House-St.-Barts/",
      "url": "https://heyletsgo.casa/posts/Guest-House-St.-Barts/",
      "title": "Guest House St Barts",
      "content_html": "<p><img src=\"../../img/beach/pexels-brent-keane-1702372.jpg\" alt=\"Guest House St Barts\"></p>\n<p>Guest House St Barts is a breathtaking guest house located in a converted boathouse on the island of St Barts. An interior design haven, Guest House St Barts is a serene retreat for those seeking a quiet, luxurious getaway from the fast pace of city life. The island’s pristine beauty is highlighted by its natural landscape, including white-sand beaches and azure waters; the guest house was built with this in mind, using natural materials like wood and stone to create an elegant but understated space.</p>\n<p>The guest house is located in Gustavia, an old harbor town that’s rich in history; it was once home to privateer Jean Jacques Dessalines d’Orléans (a French military officer who later became governor of Saint-Domingue—modern day Haiti). The property has views of Mount Pelée and the sea; inside, the walls are lined with bookshelves filled with art books and travel guides. The guest house has three bedrooms with king-sized beds, each with an en suite bathroom featuring heated floors and outdoor showers. The living room has two sofas facing each other across a coffee table flanked by two chairs; guests can sit by the fireplace or outside on the terrace to enjoy spectacular views of Gustavia Bay.</p>\n<p>The kitchen boasts custom Italian cabinetry and top-of-the-line appliances; it also has a dining table for four so guests can enjoy meals together while taking in sweeping views of St Barts’ shoreline or reading their favorite books from Guest House St Barts’ expanding library collection. A separate building houses three additional spacious suites featuring king-sized beds that are separated from each other by wood partitions that allow for privacy while allowing guests to mingle during meals or drinks at night on the terrace overlooking Gustavia Bay—the perfect spot to watch sunsets while sipping sangria or champagne!</p>\n",
      "date_published": "2021-03-27T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-St.-Barts/",
      "url": "https://heyletsgo.casa/posts/Suites-St.-Barts/",
      "title": "Suites St Barts",
      "content_html": "<p><img src=\"../../img/beach/pexels-flickr-149622.jpg\" alt=\"Suites St Barts\"></p>\n<p>Suites St Barts is a sun-soaked suites hotel located on the picturesque island of St Barts. Guests benefit from access to the SPA, which offers massages, facials, manicures and pedicures. The hotel also features tennis courts, two swimming pools and a stunning beachfront location. All suites include air-conditioning, a fully equipped kitchen, flat-screen TV and a private terrace or balcony with sea views.</p>\n",
      "date_published": "2021-03-15T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Pacuare/",
      "url": "https://heyletsgo.casa/posts/Lodge-Pacuare/",
      "title": "Lodge Pacuare",
      "content_html": "<p><img src=\"../../img/jungle/pexels-greg-galas-2092828.jpg\" alt=\"Lodge Pacuare\"></p>\n<p>Lodge Pacuare is a pristene lodge located on a private reserve on the Pacuare River. It is a wonderful place to stay while visiting Costa Rica. The lodge is not too large, so you have a pretty good chance of seeing more wildlife. It has a thatched roof and blends in with its natural surroundings.</p>\n<p>This lodge is rustic and if you are looking for a 5-star luxury resort stay away from this place. It has simple accommodations but the air conditioning works well and the rooms are clean enough. If you are a nature lover, this place is perfect for you! The views from the rooms cannot be beat! The staff at Lodge Pacuare was wonderful and friendly. They did their very best to make us feel comfortable during our stay at the lodge.</p>\n<p>We stayed in an amazing room which was on the top floor. We had our own personal balcony with a hammock overlooking the river below us. During breakfast we would see monkeys hanging out around us eating bananas from trees just outside our balcony! During our stay at the lodge we saw spider monkeys, toucans, macaws, gorgeous butterflies, and many other animals we never expected to see in Costa Rica! We also witnessed two hippos spouting in between rapids in an area of the river called “the whirlpool” which was incredible! The water there was crystal clear and it is definitely worth taking an afternoon trip there to experience it yourself! You can book this excursion directly through your hotel or through one of their tour companies such as Aventuras Naturales or Turismo De La Selva (both located in La Fortuna).</p>\n<p>We started with one activity each day at 8:30AM and most times we finished by 2:00PM or 3:00PM (depending on how much time we wanted to spend hiking)! This allowed us plenty of time to explore more activities like horseback riding (with our guide Angel), ziplining (at Zipline Canopy Tours), or walking through their butterfly garden/learning about all different types of butterflies that live in tropical rainforests (at Butterfly Garden). All these activities were included in our package also with transportation included from/to San Jose Airport (SJO) which made it really easy for us while traveling alone since sometimes English speaking guides aren’t available along with transportation options being limited due to language barriers when traveling alone while visiting other countries especially when you do not speak fluent Spanish or Portuguese languages fluently like I do not :p</p>\n<p>If you are looking for something more luxurious then Dos Pueblos Hotel located just outside of San Jose may be right up your alley although I have never stayed there so I cannot say anything about the hotel itself other than it looks nice from what I have seen online but I have heard nothing but great things about it so if luxury suites are what you prefer then Dos Pueblos Hotel may be worth considering if staying closer to San Jose area is something that interests you instead of staying closer to La Fortuna area where most hotels listed here are located unless you wish to walk 15-20 minutes into town for dinner/desserts/dancing at night etc… If that doesn’t matter then definitely consider staying closer to La Fortuna area where all these hotels below are located instead because it will give you easy access into town during dinner/desserts/dancing etc… Also many local restaurants are only open 6-9PM which means getting dinner after 6PM means having dinner around 9PM since most people eat earlier than that at restaurants close by…. Most hotels listed here allow guests free access into town during dinner time so no need to worry about eating late if staying here because many local restaurants close up shop early anyways…. Just saying ;) Hope this helps anyone who has booked hotels listed here thinking they don’t serve food until 7PM or 8PM when actually they serve food earlier than that since everything closes up shop early around 10PM anyways…</p>\n",
      "date_published": "2021-03-07T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-di-Positano/",
      "url": "https://heyletsgo.casa/posts/Hotel-di-Positano/",
      "title": "Hotel di Positano",
      "content_html": "<p><img src=\"../../img/city/pexels-olga-vunder-3038552.jpg\" alt=\"Hotel di Positano\"></p>\n<p>Hotel di Positano is a romantic hotel in a beachfront location. This is a family run hotel with a good restaurant and a beautiful garden with views of the sea. We stayed in the Ocean View Double room. The room was very nice, clean and comfortable with an amazing view! The breakfast was good and the staff super friendly and helpful. I would recommend this hotel to anyone visiting Positano!</p>\n<p>This is our second stay here and we cannot fault it one bit. We stayed in the new wing, which was absolutely immaculate and so luxurious - we loved our room so much we did not want to leave it! It would be unfair to say which we liked best as both were great - I cannot speak highly enough about this place - perfect location, excellent service, great food and lovely staff!</p>\n",
      "date_published": "2021-02-27T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Madikew-Game-Reserve/",
      "url": "https://heyletsgo.casa/posts/Camp-Madikew-Game-Reserve/",
      "title": "Camp Madikew Game Reserve",
      "content_html": "<p><img src=\"../../img/plains/pexels-pixabay-259411.jpg\" alt=\"Camp Madikew Game Reserve\"></p>\n<p>Camp Madikew Game Reserve is a private camp located in the Okavango Delta, Botswana. The accommodation is within canvas tents with thatched roofs and verandas, looking out over the floodplains beyond.</p>\n<p>The private camp is part of the Madikew community, who have lived in this region for generations. Although there are no permanent buildings, the Madikew people have worked with Nature of Africa to create a camp that fits with their traditional way of life. Nature of Africa’s staff visit the Madikew regularly to ensure that they are fully involved in all aspects of the daily running of the camp; including setting up and taking down, running activities and maintaining wildlife fences used to protect game during flood season.</p>\n",
      "date_published": "2021-02-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Yasuni-National-Park/",
      "url": "https://heyletsgo.casa/posts/Camp-Yasuni-National-Park/",
      "title": "Camp Yasuni National Park",
      "content_html": "<p><img src=\"../../img/jungle/pexels-rex-whiticker-3797503.jpg\" alt=\"Camp Yasuni National Park\"></p>\n<p>Camp Yasuni National Park is a spiritual camp that is located at the place that is surrounded by an enormous amount of trees and other plants which are considered as the lungs of the earth. This place is very close to the Ecuadorian Rainforest. The name of this national park is given after a tribe that lives in this area. The camp was established by the people who believe in preserving nature and therefore has been helpful in conserving thousands acres of rainforest.</p>\n<p>The camp offers you to participate in different activities like swimming, snorkeling, kayaking, hiking, biking, bird watching etc. You can also participate in several workshops that are organized by local community leaders. When you are participating in these activities you will be able to learn about the culture of indigenous people who live there.</p>\n<p>You can even take your kids along with you or even your family because during your stay at this camp they will be able to explore their own potentials and talents through different activities which are available there. When you are planning for a trip to this camp it will be better if you take an expert guide with you because he or she will be able to explain everything about this region which can be really interesting for them. If kids want to go through jungle survival training they can join it as well since it is really awesome for them.</p>\n",
      "date_published": "2021-02-15T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Ocean-View/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Ocean-View/",
      "title": "Hotel and Spa Ocean View",
      "content_html": "<p><img src=\"../../img/beach/pexels-arthouse-studio-4571791.jpg\" alt=\"Hotel and Spa Ocean View\"></p>\n<p>Hotel and Spa Ocean View is a magical Hotel and Spa, nestled on the beach in the heart of the Dominican Republic. The hotel sits on a spectacular oceanfront location, just 5 minutes from Juan Dolio's famous El Cortecito beach, 10 minutes from Santo Domingo's Colonial City and 25 minutes from La Isabela International Airport. With all rooms featuring ocean views and elegant decor, this is a great choice for travelers looking to relax in style. As well as all this, there is also an outdoor swimming pool and a free Wi-Fi network.</p>\n<p>Hotel and Spa Ocean View features 40 rooms that are elegantly decorated and feature simple furnishings with tropical touches. All rooms have air conditioning, cable TV and private bathroom with bathtub and shower facilities.</p>\n<p>The hotel's restaurant serves breakfast and dinner buffets and specializes in Dominican and International cuisine. The hotel also offers free WiFi throughout its public areas. Other amenities include room service, 24-hour front desk service, concierge service, laundry services (fees apply) and ironing services (fees apply).</p>\n",
      "date_published": "2021-02-07T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-Osa-Peninsula/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-Osa-Peninsula/",
      "title": "Safari Camp Osa Peninsula",
      "content_html": "<p><img src=\"../../img/jungle/pexels-maria-orlova-4917176.jpg\" alt=\"Safari Camp Osa Peninsula\"></p>\n<p>Safari Camp Osa Peninsula is a romantic safari camp located in Punta Leona, where you can enjoy nature in its purest form. Punta Leona is located in the lush Osa Peninsula, about 20 minutes from the city of Puerto Jimenez. The resort has two rivers that run through the property, which are perfect for swimming and tubing. Guests can also go horseback riding through the jungle or go fishing in the lagoon.</p>\n<p>Eco-Lodge at Carara National Park is located near the Carara Biological Reserve, a protected national park where you can see spider monkeys swinging from tree to tree. The lodge is located on a private reserve with 3 lodges, 4 cabins and 2 tents where you can enjoy nature in its purest form. At night guests will be able to look at the stars through one of the largest telescopes in Costa Rica.</p>\n<p>Las Catalinas Hotel &amp; Resort is located in Playa Panama just 20 minutes from Tamarindo Beach. The hotel has 11 bungalows with private terraces overlooking the sea and gardens filled with flowers and tropical plants including coconut palms, guaria morada (a flowering plant) and indigenous trees such as ojochal (orchid tree) and guacimo (bean tree).</p>\n",
      "date_published": "2021-02-03T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-Kensington/",
      "url": "https://heyletsgo.casa/posts/Suites-Kensington/",
      "title": "Suites Kensington",
      "content_html": "<p><img src=\"../../img/city/pexels-aleksandar-pasaric-2067057.jpg\" alt=\"Suites Kensington\"></p>\n<p>Suites Kensington is a breathtaking suites hotel in the heart of London. Enjoy contemporary design, WIFI, luxurious bathrobes, and complimentary refreshments. The hotel features an on-site restaurant and several bars for your enjoyment.</p>\n<p>Perfectly located in the heart of Kensington, this hotel is within walking distance of the London Eye, Kensington Palace, Hyde Park, and Buckingham Palace.</p>\n",
      "date_published": "2021-01-30T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Rift-Valley/",
      "url": "https://heyletsgo.casa/posts/Camp-Rift-Valley/",
      "title": "Camp Rift Valley",
      "content_html": "<p><img src=\"../../img/plains/pexels-pixabay-70080.jpg\" alt=\"Camp Rift Valley\"></p>\n<p>Camp Rift Valley is a breathtaking camp, nestled in the heart of the Great Rift Valley. It is set on a raised balcony, overlooking a sweeping panorama of wildlife and savannah.</p>\n<p>The camp offers spacious and comfortable en-suite tents with king-size beds, an en-suite bathroom and a separate dressing room. The Tented Camp is exclusively for adults only (minimum 18 years old).</p>\n<p>All the tents are equipped with iPod docking stations, air conditioning and ceiling fans. Each has its own private viewing deck with spectacular views of the Maasai Mara. The tents are fully serviced every day and evening tea is served in the main lounge area at 5:30 pm each evening. A full range of drinks and snacks is available 24 hours a day from our pantry.</p>\n",
      "date_published": "2021-01-22T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Resort-Ocean-Sunset/",
      "url": "https://heyletsgo.casa/posts/Resort-Ocean-Sunset/",
      "title": "Resort Ocean Sunset",
      "content_html": "<p><img src=\"../../img/beach/pexels-jess-loiterton-5006981.jpg\" alt=\"Resort Ocean Sunset\"></p>\n<p>Resort Ocean Sunset is a romantic resort on the shores of the Baltic Sea, on the Swedish island of Öland. Its location is stunning, and it provides a quiet and peaceful environment. The rooms are decorated in a cozy Scandinavian style, and they all have a sea view. The hotel also offers a restaurant that serves excellent food.</p>\n<p>The resort was designed by architect Arkadi Zaides, who has been honored with numerous international prizes for his work. In 2005, he received the prestigious “World Architecture Award” for his work at Ocean Sunset.</p>\n<p>Hotel Puerta America is located in Mexico City’s Zona Rosa district. This beautiful hotel overlooks Avenida Presidente Masaryk and provides guests with a panoramic view of the city’s most famous avenue. It has a total of 481 rooms and suites, including 55 junior suites and 7 executive suites that offer more comfort and luxury to their guests. There is also an outdoor swimming pool surrounded by an area with sun loungers where you can relax after a long day in the city center or after visiting one of Mexico’s top museums such as the Museum of Anthropology or National History Museum located just minutes away from the hotel.</p>\n",
      "date_published": "2021-01-04T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Palace-Sant-Andrea/",
      "url": "https://heyletsgo.casa/posts/Palace-Sant-Andrea/",
      "title": "Palace Sant Andrea",
      "content_html": "<p><img src=\"../../img/city/pexels-jonathan-petersson-528427.jpg\" alt=\"Palace Sant Andrea\"></p>\n<p>Palace Sant Andrea is a sophisticated palace built in the early 17th century by the architect Antonio da Sangallo. It has four tall storeys and a tall attic, and is similar in style to Palazzo Spada.</p>\n<p>The palace was commissioned by Cardinal Scipione Borghese, nephew of Pope Paul V (1605-1621) and patron to Bernini among others, for his own use. Its design was probably based on drawings by Raphael, who was to have been its original owner. It is built around an open colonnaded courtyard which had no garden access until the 19th century. The entrance leads into the hall of the first floor with its famous frescoed ceiling painted by Giovanni da San Giovanni in 1603 depicting angels playing musical instruments. At the far end is the chapel, with its gilded ceiling by Guercino (1619), surmounted by a cupola decorated with frescoes depicting four episodes from the life of Christ. The chapel also contains two marble angels by Bernini (1621-22). The large busts are of Julius Caesar and Alexander Severus, rescued from their earlier site at Palazzo Farnese after it was demolished to make way for St Peter's basilica.</p>\n<p>Palazzo Barberini</p>\n<p>Palazzo Barberini is one of Rome's greatest Baroque palaces built between 1625 and 1633 for Cardinal Maffeo Barberini, nephew of Pope Urban VIII (1623-44). Its design was probably inspired by drawings for another palace commissioned from Borromino but never executed due to Borromino's death in 1667.</p>\n<p>The palace has two courtyards surrounded on all sides by tall storeys above an equally tall basement or ground floor containing service rooms. Access between floors is through an elegantly tiled staircase leading up through a small loggia overlooking the Piazza Barberini which opens onto a second loggia leading into one of two internal courtyards flanked on all sides with high arches supporting more storeys above it punctuated by huge oval windows that flood light into all parts of this vast palatial complex designed as a city within a city within Rome itself.</p>\n",
      "date_published": "2020-12-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-Pacuare/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-Pacuare/",
      "title": "Safari Camp Pacuare",
      "content_html": "<p><img src=\"../../img/jungle/pexels-teguh-sugi-6121916.jpg\" alt=\"Safari Camp Pacuare\"></p>\n<p>Safari Camp Pacuare is a spiritual safari camp on the banks of the Pacuare River, near Turrialba. It is located in the central valley of Costa Rica, about 1 hour and 15 minutes' drive from San Jose. It is an ideal base for adventure tourists looking to explore the surrounding area on foot or horseback.</p>\n<p>The Pacuare river is famous for its magnificent white water rafting, kayaking and tubing. The river is known as one of the best rafting rivers in Costa Rica. The rapids are relatively easy with few rocks or overhead dangers on this section of the river that flows through the rain forest. There are three different levels of difficulty on this trip ranging from Class II to Class IV rapids, with a total drop of more than 80 feet in elevation during a descent of 4 miles (6 km). This section of river is also suitable for novice rafters. The guided rafting tours include transportation from San Jose Airport or San Jose hotels or you can drive yourself to the Pacuare River Valley by car rental, taxi or minibus shuttle service from hotels in San Jose.</p>\n<p>Safari Camp Pacuare offers both private and group white water rafting trips with full services including hotel pick-up &amp; return at any location in San Jose area, 2 meals per day prepared by professional chefs and bilingual guides/cooks who will provide you with lots of information about flora and fauna as well as colorful legends about animals and natural wonders along the river tour route.. For those who want to spend more time enjoying nature away from civilization we offer camping options at our beautiful campsite located right on the river bank where you can experience all kind adventures such as: rappel down waterfalls, hiking through tropical forest trails, exploring caves and caverns by boat, horseback riding through virgin forest rides following local guides who know all about medicinal plants and much more.</p>\n",
      "date_published": "2020-12-15T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Naladhu/",
      "url": "https://heyletsgo.casa/posts/Lodge-Naladhu/",
      "title": "Lodge Naladhu",
      "content_html": "<p><img src=\"../../img/beach/pexels-brent-keane-1702372.jpg\" alt=\"Lodge Naladhu\"></p>\n<p>Lodge Naladhu is a upscale lodge situated in the heart of Kumana National Park, Sri Lanka. It is a wildlife sanctuary with a variety of wildlife including an elephant population.</p>\n<p>Kumana National park has the largest population of elephants in Sri Lanka. The elephants are featured in the logo of the lodge. Kumana National Park is home to a wide range of animals including leopards, wild buffaloes, deer, Nilgiri langurs and many varieties of birds.</p>\n<p>Kumana National Park was established in 1975 under the Wildlife Ordinance No. 31 of 1972 to protect this unique ecosystem. The park is accessible via Oluvil Beach on the southern coast, approximately 50 kilometres from Matara town. There are two entrances to the park - one via Oluvil and another via Udawalawe.</p>\n",
      "date_published": "2020-12-09T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Madikew-Game-Reserve/",
      "url": "https://heyletsgo.casa/posts/Ranch-Madikew-Game-Reserve/",
      "title": "Ranch Madikew Game Reserve",
      "content_html": "<p><img src=\"../../img/plains/pexels-saifuddin-ratlamwala-3849687.jpg\" alt=\"Ranch Madikew Game Reserve\"></p>\n<p>Ranch Madikew Game Reserve is a charming ranch surrounded by the picturesque Drakensberg Mountains. The well-managed ranch is an ideal destination for horse riding, hiking, bird watching and game viewing. The ranch is located in the Royal Natal National Park which has a population of black rhino. Guests can stay at the comfortable ranch house with a swimming pool, surrounded by beautiful grounds with indigenous trees and an impressive collection of animals - including ostriches, zebras, giraffes, springboks, impalas and many species of birds.</p>\n",
      "date_published": "2020-12-01T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-di-Positano/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-di-Positano/",
      "title": "Hotel and Spa di Positano",
      "content_html": "<p><img src=\"../../img/city/pexels-leah-kelley-952586.jpg\" alt=\"Hotel and Spa di Positano\"></p>\n<p>Hotel and Spa di Positano is a gorgeous Hotel and Spa located in Positano, Italy. The hotel is surrounded by a stunning landscape and is a perfect choice for anyone who’s looking for a relaxing break from busy city life.</p>\n<p>The hotel has 50 rooms and suites, all of which come with private terraces, sea views and free Wi-Fi. Guests can also enjoy the modern facilities of the spa area which include a sauna, steam room and an indoor pool.</p>\n<p>In addition to this, guests can enjoy delicious meals at Hotel and Spa di Positano restaurant or relax at the beach bar. Having been awarded as TripAdvisor’s 2016 Certificate of Excellence and as one of Condé Nast Traveler’s Top Hotels in Italy, Hotel and Spa di Positano offers excellent facilities and services at affordable prices.</p>\n",
      "date_published": "2020-11-19T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-St.-Barts/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-St.-Barts/",
      "title": "Hotel and Spa St Barts",
      "content_html": "<p><img src=\"../../img/beach/pexels-jess-loiterton-5006981.jpg\" alt=\"Hotel and Spa St Barts\"></p>\n<p>Hotel and Spa St Barts is a upscale Hotel and Spa located on the island of St Barts, in the French West Indies. This is one of the most luxurious hotels in St Barts, it is an adults only hotel with a beautiful beach and a wide array of water sports to enjoy during your vacation.</p>\n<p>Located in Gustavia, Saint Barthelemy / Saint Barthélemy, Hotel and Spa St Barts is close to the airport and close to Le Port.</p>\n<p>Hotel and Spa St Barts has a total of 45 rooms that are all equipped with air conditioning, a private bathroom and a flat-screen TV with satellite channels. The room facilities also include a mini bar, a safety deposit box and a hairdryer. Some rooms feature a terrace overlooking the garden or sea views from their balconies or terraces have been built for your comfort and entertainment you can use free Wi-Fi access in all areas of the resort and free parking when you arrive by car.</p>\n<p>In addition to accommodation Hotel and Spa St Barts offers an outdoor pool, sun terrace which will allow you to unwind comfortably in this quiet setting while enjoying views of the sea or garden surroundings or even just take some time for yourself reading a book on one of their sun loungers without having to worry about being disturbed by anyone else in this adults only hotel! In addition they have an attractive spa offering massages, body treatments and other spa therapies such as reflexology, aromatherapy massages...For those who want to get active during their stay at Hotel and Spa St Barts they offer water sports such as windsurfing (with equipment rental), snorkeling (with equipment rental), diving (with equipment rental), catamaran sailing (with equipment rental) canoeing for rates for adults and children at any time during your stay at this paradise hotel! And if you're looking for more relaxation during your vacation then there's no better way than enjoying one of the many relaxing treatments offered at this 5 star hotel: aromatherapy massage (60 minutes: 200 euros) , hot stone massage (90 minutes: 260 euros) , reflexology massage (60 minutes: 200 euros) , traditional Thai massage (80 minutes: 230 euros) ...And if you need any assistance while you're staying at Hotel and Spa St Barts do not hesitate to ask their staff about anything you might need help with while staying at this luxury resort! Their staff speaks English and French!</p>\n",
      "date_published": "2020-11-11T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Virgin-Gorda/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Virgin-Gorda/",
      "title": "Hotel and Spa Virgin Gorda",
      "content_html": "<p><img src=\"../../img/beach/pexels-asad-photo-maldives-1266833.jpg\" alt=\"Hotel and Spa Virgin Gorda\"></p>\n<p>Hotel and Spa Virgin Gorda is a gorgeous Hotel and Spa, high up on a hillside overlooking the Caribbean Sea. As I’ve written about before, this hotel is a tranquil oasis peeks out from the lush foliage of Virgin Gorda. It is a little jewel of a resort that has been designed with an eco-friendly touch, as it focuses on sustainable practices and green initiatives.</p>\n<p>The rooms are very comfortable at this resort, as they have been modernized with the necessary features to make your stay as relaxing as possible. The bathroom is well-equipped and spacious and I especially liked the fact that each room has its own private balcony.</p>\n<p>As for dining options, there are two restaurants – one casual and the other fine dining – plus a pool bar and a beach bar. At the pool bar you’ll find fresh fruit shakes and smoothies along with light snacks such as cheese platters and sandwiches. The beach bar serves up tasty cocktails such as Painkillers (dark rum, pineapple juice, peanut butter &amp; coconut milk) along with small bite snacks such as crudites or roasted sweet potatoes topped with jerk seasoning.</p>\n<p>I highly recommend trying out their signature bath menu (the sauna and steam room at this hotel come free!) which includes an array of spa services like massages, facials, body treatments and wraps. You can also enjoy treatments in your own room or suite if you wish! If you’re looking for some romantic alone time together, book one of their couples massage sessions (which can also be done in your room) – they offer Swedish massage (60 mins.) or Acupressure massage (90 mins.). I opted for the acupressure massage which was excellent! My husband opted for an hour long Swedish massage which he said was superb; he actually almost fell asleep at one point!</p>\n",
      "date_published": "2020-10-23T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Sabi-Sands/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Sabi-Sands/",
      "title": "Ecolodge Sabi Sands",
      "content_html": "<p><img src=\"../../img/plains/pexels-antony-trivet-6053075.jpg\" alt=\"Ecolodge Sabi Sands\"></p>\n<p>Ecolodge Sabi Sands is a private ecolodge located in the Sabi Sands Private Game Reserve in South Africa. As the only private luxury lodge situated inside the Sabi Sand Game Reserve, Ecolodge Sabi Sands is ideal for those wishing to explore the region on foot.</p>\n<p>The rich diversity of the Sabi Sand ecosystem is home to an abundant variety of game including elephant, lion, cheetah, buffalo and leopard. Guests are able to explore the bush on foot or drive along our extensive network of dirt roads. The lodge offers an exclusive service for small groups which includes a personal guide who will accompany guests on game drives and walks to ensure their every wish is granted.</p>\n<p>The heart of Ecolodge Sabi Sands consists of four uKhahlamba traditional rondavels set amongst lush indigenous forest overlooking a waterhole where elephants regularly come to drink. The four en-suite rondavels have been designed with both comfort and style in mind with ensuite bathrooms, underfloor heating and an open plan design that will ensure you never feel too far away from nature. No two rondavels are identical; each has its own individual character with huge picture windows allowing guests to enjoy uninterrupted views over this magical area.</p>\n<p>There are also three spacious tented suites made from canvas and wood offering an experience not found anywhere else in South Africa today. Each tent has its own private decking area which overlooks the waterhole where game can be easily spotted; no decking area is ever shared with other tents. The style is rustic but comfortable; each tent features a double bed, comfortable lounges and stunning décor throughout including hand-loomed floor coverings made by local women at Stony Plain Farm (a community initiative run by Ecolodge) located just outside Hazyview - approximately 20 minutes by road from Ecolodge Sabi Sands - as well as stunning traditional handmade furniture made locally using indigenous materials such as wickerwork, brickwork and woodcarvings sourced from local villages around Hazyview.</p>\n",
      "date_published": "2020-10-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-Puerto-Maldonado/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-Puerto-Maldonado/",
      "title": "Safari Camp Puerto Maldonado",
      "content_html": "<p><img src=\"../../img/jungle/pexels-jason-boyd-3209049.jpg\" alt=\"Safari Camp Puerto Maldonado\"></p>\n<p>Safari Camp Puerto Maldonado is a rustic safari camp in the Madre de Dios region of Peru, near the Tambopata River, a major tributary of the Amazon River.</p>\n<p>While a stay in a tent may not be your idea of luxury, it is a unique way to experience the jungle. By staying at Safari Camp Puerto Maldonado, you’ll get up close and personal with nature in a way that’s impossible in any other way.</p>\n<p>At Safari Camp Puerto Maldonado you can enjoy an exciting morning breakfast walk through the jungle, wildlife viewing from your hammock during lunch and dinner walks by torchlight to observe night sounds and animals. During off-hours you can enjoy an amazing variety of activities including fishing, kayaking or exploring nearby lagoons by canoe in search for caiman and other species in their natural habitat.</p>\n<p>Safari Camp Puerto Maldonado is located 4 hours from Cusco and 3 hours from Madre de Dios capital Puerto Maldonado.</p>\n",
      "date_published": "2020-10-19T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Palace-Bristol/",
      "url": "https://heyletsgo.casa/posts/Palace-Bristol/",
      "title": "Palace Bristol",
      "content_html": "<p><img src=\"../../img/city/pexels-caio-179767.jpg\" alt=\"Palace Bristol\"></p>\n<p>Palace Bristol is a breathtaking palace of luxury, featuring a truly unique blend of both traditional English design and modern comfort. This magnificent building has been restored to the highest quality, with the finest materials, exquisite furnishings and beautifully appointed rooms that are all sumptuously appointed with the finest fabrics. An elegant dining room offers fine dining in a truly special atmosphere, while an exquisite lounge area provides an inviting space to relax with friends before retiring to your luxurious bedroom for a peaceful night's sleep. All of the rooms in this outstanding palace are sound-proofed and boast excellent facilities, including satellite television and free Wi-Fi access. After a refreshing nights sleep you can enjoy hearty breakfasts in the Bristol restaurant before spending the day exploring Bath or Bath Abbey - whether you're looking for sightseeing or shopping this is an ideal location.</p>\n",
      "date_published": "2020-10-05T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Naladhu/",
      "url": "https://heyletsgo.casa/posts/Inn-Naladhu/",
      "title": "Inn Naladhu",
      "content_html": "<p><img src=\"../../img/plains/pexels-rachel-claire-4577147.jpg\" alt=\"Inn Naladhu\"></p>\n<p>Inn Naladhu is a rural inn and it's a great place to stay and chill out. The place is located near the famous Mookambika Temple and has its own private beach. This is a beautiful place and we had a great time here. The beach is beautiful, we enjoyed swimming and snorkelling there. The staff is very friendly and helpful as well as the manager. They arranged our trip to the Mookambika Temple by car, which was really nice of them as we didn't have any idea how to go there on our own. We were also very happy that they let us keep our vehicle in their garage for 2 days while we visited the temple, which was a great help since it would have been hard to find a place for our car there.</p>\n<p>We stayed at their deluxe room, which was really nice and clean with AC, hot shower and tv. The room was facing the beach so you can enjoy nice views from your room as well as from the balcony where you could sit down for breakfast or dinner or just enjoy your coffee/tea during sunrise or sunset. I also liked the fact that they have no restaurant at their property but they have an arrangement with some local restaurants nearby so if you want to eat something other than vegetarian food you can do this easily without going outside of your hotel premises.</p>\n<p>This place is good for couples but also families with kids would enjoy staying here as well because of its beautiful beach area and because of its proximity to Mookambika Temple (which has facilities for kids). View all 19 photos</p>\n",
      "date_published": "2020-10-01T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Sabi-Sands/",
      "url": "https://heyletsgo.casa/posts/Camp-Sabi-Sands/",
      "title": "Camp Sabi Sands",
      "content_html": "<p><img src=\"../../img/plains/pexels-saifuddin-ratlamwala-3849687.jpg\" alt=\"Camp Sabi Sands\"></p>\n<p>Camp Sabi Sands is a ecological camp that has been operating for more than 20 years. The camp is set on a private game reserve, which is located about an hour east of Kruger National Park.</p>\n<p>The camp offers traditional safari tents, luxury tents and family rooms with shared facilities. Free WiFi is also available throughout the property.</p>\n<p>Amenities include a swimming pool, spa, restaurant and bar.</p>\n<p>Activities include game drives in open 4x4 vehicles, guided walks and night drives with spotlights to spot nocturnal animals. Horse riding trails are also available nearby.</p>\n",
      "date_published": "2020-09-09T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Kensington/",
      "url": "https://heyletsgo.casa/posts/Inn-Kensington/",
      "title": "Inn Kensington",
      "content_html": "<p><img src=\"../../img/city/pexels-ahmed-abdelaziz-453201.jpg\" alt=\"Inn Kensington\"></p>\n<p>Inn Kensington is a rustic inn with a great view of the lake. They have a large menu and offer a kids menu as well. The meal I ordered was great. We had a pasta with chicken and cheese which was delicious, with a nice little twist to it that I can’t quite describe, but was really good. The service here was excellent as well as the prices were reasonable.</p>\n<p>Cottage Country Village &amp; Cottages is one of my favorite places to visit when we are in the area. It is a very quaint little village with so many stores to visit, including but not limited to; an ice cream shop, gift shops, clothing stores, candy shops and more! There are also some really cool cottages you can stay in if you would like (we stayed in one once!) There is also another restaurant there called Cottage Cafe which I will be reviewing soon! It has an amazing view of the lake and has some great food as well! More on that later though…</p>\n<p>Ontario’s Wonderland (or Canada’s Wonderland) is an amusement park near Toronto that features 4 roller coasters including Leviathan which has the biggest drop of any roller coaster in Canada! This amusement park hosts events all year round for anyone who loves amusement parks or just wants to enjoy the rides without other people around. It also includes some other attractions such as water parks and mini golf courses along with other fun things you can do here year round!</p>\n",
      "date_published": "2020-08-06T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Paracas/",
      "url": "https://heyletsgo.casa/posts/Camp-Paracas/",
      "title": "Camp Paracas",
      "content_html": "<p><img src=\"../../img/plains/pexels-kelly-l-3311093.jpg\" alt=\"Camp Paracas\"></p>\n<p>Camp Paracas is a rustic campground located on the southern shore of Paracas Bay on the Pacific coast in the Paracas District of Peru. It is a small campground with a relaxed atmosphere situated directly on the sand, close to the beach. It is a great place for swimming and sunbathing. The campground has several shaded tables and benches providing a great place to relax, eat some food, and take in the views of Paracas Bay. Camping sites are located right along the sand, with some sites even having a little green space providing a bit more privacy between visitors. There are no restroom or shower facilities at this campground, however there is an outhouse located up from the beach with running water and stocked with toilet paper.</p>\n<p>The campground is located close to several local restaurants and shops where you can buy basic food supplies such as bread, milk, juice and even beer if you so desire. There is also a small convenience store called ‘Aleman’ which sells basic toiletries such as soap and toothpaste. A short walk up from Aleman you will find ‘El Aleman’ restaurant which serves both breakfast and lunch daily with great sea views from their outdoor patio dining area.</p>\n",
      "date_published": "2020-06-25T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Resort-Zighy-Bay/",
      "url": "https://heyletsgo.casa/posts/Resort-Zighy-Bay/",
      "title": "Resort Zighy Bay",
      "content_html": "<p><img src=\"../../img/beach/pexels-jasmine-ortega-4060149.jpg\" alt=\"Resort Zighy Bay\"></p>\n<p>Resort Zighy Bay is a sun-soaked resort that stretches out along the coast, with its own private beach and a fleet of luxury yachts that can whisk guests off on private cruises.</p>\n<p>The hotel’s lavish public spaces are inspired by the local culture, while also providing easy access to the hotel’s facilities. The main restaurant overlooks the beach and has its own private terrace for guests to enjoy alfresco dining in summer months.</p>\n<p>The elegant rooms and suites at Resort Zighy Bay feature a bold design with rich colors that reflect Omani culture, while also providing all the modern amenities of a luxury hotel.</p>\n<p>The hotel is classified by TripAdvisor as a TripAdvisor Travellers’ Choice award winner for 2017 in the “Top Hotels in Oman” category.</p>\n<p>Resort Zighy Bay is a member of Small Luxury Hotels of the World (SLH), an international chain of boutique hotels with locations from Bali to Mauritius.</p>\n",
      "date_published": "2020-05-30T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-Grosso/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-Grosso/",
      "title": "Safari Camp Grosso",
      "content_html": "<p><img src=\"../../img/jungle/pexels-teguh-sugi-6121916.jpg\" alt=\"Safari Camp Grosso\"></p>\n<p>Safari Camp Grosso is a rustic safari camp consisting of 12 tents and 2 suites. The camp overlooks a waterhole and the camp has its own private airstrip. Game drives and bushwalks can be arranged with lodge staff.</p>\n<p>Safari Camp Grosso is highly recommended as a good experience for those who want to move away from the more common &quot;high end&quot; safari camps, but don't want to compromise on the quality of service offered.</p>\n",
      "date_published": "2020-05-26T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-di-Carpiano/",
      "url": "https://heyletsgo.casa/posts/Inn-di-Carpiano/",
      "title": "Inn di Carpiano",
      "content_html": "<p><img src=\"../../img/city/pexels-leah-kelley-952586.jpg\" alt=\"Inn di Carpiano\"></p>\n<p>Inn di Carpiano is a rustic inn, situated on a hill about 50 km from Bergamo. The inn is located in the hamlet of Carpiano, a small settlement at the foot of Monte Corno, a mountain about 1477m high, covered by the “Alta Val Brembana” National Park. The surrounding area is mainly agricultural, but also includes forests and picturesque valleys.</p>\n<p>The area has many interesting places to visit:</p>\n<p>– Lanzo d’Intelvi (12 km) is an old village with narrow streets and small squares where you can still see medieval houses; it is well known for its cheese specialities;</p>\n<p>– Arona (15 km) is an old town on the banks of Lake Maggiore; it has well preserved medieval walls and represents an important centre for trade and industry;</p>\n<p>– Lecco (30 km), well known for its lake views and famous for its salt mines; here you can admire the impressive Castello Baradello, built in 1205 during the reign of Enrico III; to reach it you have to take the cable car that connects Lecco to Colico (1 hour);</p>\n<p>– Bergamo (50 km), “the city of hills” where you can enjoy typical dishes like polenta, rice with mushrooms or ravioli stuffed with spinach or ricotta cheese; to reach Bergamo you need to descend 428 metres along Corso Francia street.</p>\n",
      "date_published": "2020-05-10T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Madikew-Game-Reserve/",
      "url": "https://heyletsgo.casa/posts/Inn-Madikew-Game-Reserve/",
      "title": "Inn Madikew Game Reserve",
      "content_html": "<p><img src=\"../../img/plains/pexels-kelly-l-3311093.jpg\" alt=\"Inn Madikew Game Reserve\"></p>\n<p>Inn Madikew Game Reserve is a remote inn located in the Blyde River Canyon, in Mpumalanga, South Africa.</p>\n<p>It is situated on the banks of the Madikew River, close to the Blyde River Canyon nature reserve. The inn is surrounded by indigenous forests and wildlife, including monkeys and birds. Activities at the Madikew Game Reserve include game drives, game walks and bird watching.</p>\n",
      "date_published": "2020-03-28T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-Sandy-Dunes/",
      "url": "https://heyletsgo.casa/posts/Suites-Sandy-Dunes/",
      "title": "Suites Sandy Dunes",
      "content_html": "<p><img src=\"../../img/beach/pexels-arthouse-studio-4571791.jpg\" alt=\"Suites Sandy Dunes\"></p>\n<p>Suites Sandy Dunes is a spiritual suites retreat. There is a variety of meditation classes available in this town.</p>\n<p>The Healing Art Studio is a community-based art and healing studio. They offer art classes and workshops, and host an annual retreat called “Escape the City” where people get together to create art and de-stress together.</p>\n<p>Sandy Dunes offers a variety of great vegan restaurants all over town. Some of the notable ones are:</p>\n<p>The Raw Can Roll Café serves raw vegan cuisine, desserts, smoothies and juices. They offer a variety of smoothies such as the Slim Green Smoothie (which is made with flax seeds, bluegreen algae, kale, spinach, cucumber and celery), and they serve delicious raw vegan delights such as the Raw Can Roll (a delicious wrap made with sprouts seeds, red cabbage and romaine lettuce). They also serve raw vegan desserts such as the Raw Vanilla Cake (made with dates, shredded coconut and raisins) or brownies made from dates and other ingredients. It’s definitely worth stopping by this place if you need to refuel while you’re enjoying your relaxing stay at Sandy Dunes! The Raw Can Roll Café is located at 1677 South Highway 89A in Sandy Dunes Village #2. You can contact them on Facebook here or call them at +1-928-367-2952.</p>\n<p>Green Life Restaurant serves vegan food that is locally grown in organic soil without harmful chemicals or pesticides. They make sure that everything they serve is natural! Their menu includes soup, salads, sandwiches, burritos, burgers and brown rice bowls. Their food is prepared fresh daily from scratch using all organic ingredients from their own gardens! Green Life Restaurant has been featured on ‘The Travel Channels Best Sandwiches in America’ show among many others because their sandwiches are really delicious! Just one example of their tasty dishes is their Curried Chickpea Salad Sandwich which consists of curried chickpeas served on a fresh baked whole wheat baguette with sliced avocado spread on top! Green Life Restaurant has two locations in Sandy Dunes: one at 175 E State Hwy 89A &amp; 89B Suite C9 in Sandy Dunes Village 2 &amp; one at 221 Main Street Suite A in Main Street Square Shopping Center #16 in Main Street Square Shopping Center here. You can contact them on Facebook here or call them at +1-928-367-2626 for reservations for large groups only.</p>\n",
      "date_published": "2020-03-16T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Palace-Gritti-Palace/",
      "url": "https://heyletsgo.casa/posts/Palace-Gritti-Palace/",
      "title": "Palace Gritti Palace",
      "content_html": "<p><img src=\"../../img/city/pexels-andrew-neel-3201763.jpg\" alt=\"Palace Gritti Palace\"></p>\n<p>Palace Gritti Palace is a stylish palace in the Gritti Palace in Venice.</p>\n<p>The Rialto Bridge Rialto Bridge is a 15th-century bridge that crosses the Grand Canal in Venice, Italy, and connects the San Marco and San Polo districts.</p>\n<p>Santa Maria della Salute Santa Maria della Salute is a Roman Catholic church and minor basilica in Venice.</p>\n<p>The Grand Canal The Grand Canal (Italian: Canal Grande, Venetian: Canałasso) is one of the most famous canals in the world.</p>\n",
      "date_published": "2020-03-04T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Paracas/",
      "url": "https://heyletsgo.casa/posts/Inn-Paracas/",
      "title": "Inn Paracas",
      "content_html": "<p><img src=\"../../img/plains/pexels-saifuddin-ratlamwala-3849687.jpg\" alt=\"Inn Paracas\"></p>\n<p>Inn Paracas is a spiritual inn, with beautiful views of both the ocean and the nearby hills. The sunsets are spectacular. Located on the beach, only about 100 meters away from Paracas Bay. It also has a restaurant, bar and room service. The rooms here are elegant and fully equipped, with quality mattresses and linens. There is also parking available.</p>\n<p>Hospedaje El Paraíso is in a perfect location, right in front of Paracas Bay, offering great views of the bay, Islas Ballestas and the town. Inside it has a restaurant that serves typical food from this area, including fresh seafood caught in the bay. The rooms are comfortable and clean, with cable TV and private bathrooms. It also offers free Wi-Fi throughout its facilities, 24 hour security service and hot water in all areas of the hotel.</p>\n",
      "date_published": "2020-02-29T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Brush-Creek/",
      "url": "https://heyletsgo.casa/posts/Ranch-Brush-Creek/",
      "title": "Ranch Brush Creek",
      "content_html": "<p><img src=\"../../img/plains/pexels-antony-trivet-6053075.jpg\" alt=\"Ranch Brush Creek\"></p>\n<p>Ranch Brush Creek is a charming ranch house located in the historic Rancho De Las Animas area. The design of this home is a high-end version of a wide-plank wood floor and a very contemporary western aesthetic.</p>\n<p>The walls were left open to the living room, giving the home an airy feel with plenty of windows and views from every side. The kitchen itself is a nice mix of modern touches and rustic touches, which makes it feel very homey.</p>\n<p>The large windows in the great room make it feel even larger, while also affording this home a lot of natural light. The black cabinets and white countertops give this kitchen a very clean look that is also easy to clean, something that is important for a busy family with small children.</p>\n",
      "date_published": "2020-02-25T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-Castille/",
      "url": "https://heyletsgo.casa/posts/Chateau-Castille/",
      "title": "Chateau Castille",
      "content_html": "<p><img src=\"../../img/city/pexels-aleksandar-pasaric-3048538.jpg\" alt=\"Chateau Castille\"></p>\n<p>Chateau Castille is a rustic Chateau, originally built in the 17th century, with a later extension. It was the home of Jean-Baptiste Colbert, the powerful minister of King Louis XIV.</p>\n<p>The Chateau was built in 1637 for Antoine de Montchapet, a lord of Blérancourt. His son, Pierre-Paul de Montchapet, inherited it in 1649 and changed his name to Montchapet de Castille. He was a supporter of King Louis XIII and served as his treasurer for thirteen years before retiring to Blérancourt at the end of his career. His son Jean-Baptiste de Castille took up residence at Blérancourt after his father's death; he had served as &quot;prévôt des marchands&quot; (roughly equivalent to mayor) of Paris under Louis XIV before retiring to Blérancourt. The king gave him permission to change his name to de Castille d'Espira; this was an attempt by Louis XIV to ensure that all members of the family used the same surname (de Castille d'Espira).</p>\n<p>Castille d'Espira commissioned architect Nicolas Ledoux to build an estate house at Blérancourt around 1695; construction was complete by 1696. Some sources claim that Ledoux based it on designs by François Mansart or Charles Le Brun, but this is unlikely given that Ledoux worked primarily in Paris during this period and only rarely traveled outside the city. It is more probable that he borrowed elements from these designs because he knew them well through copies prepared for Mansart's books on architecture or because they were part of Ledoux's personal collection. He may also have studied engravings made after plans for these mansions during his trip to Italy in 1680–1682, although there are no records showing that he traveled outside northern Italy during this trip. Another source claims that Ledoux drew inspiration from Chateau Sainte-Marie-Madeleine, although there are no similarities between Chateau Sainte-Marie-Madeleine and Castille d'Espira other than both being constructed in brick with stone quoins and rusticated stone lintels above windows and doors.</p>\n<p>Castille d'Espira died in 1708 without an heir; his property was sold off over several years beginning in 1712 despite attempts by relatives to keep it out of the hands of strangers or merchants who would likely demolish it once they obtained possession so they could collect taxes on it even though no taxes had been paid since 1698 when Eûgène de Pérusse bought it from its owner at the time Pierre Amelot de Chailloue who received it for services rendered . The estate passed into Pérusse's ownership until 1721 when Jean Bonnefon bought it through intermediaries before selling it just one year later to Pierre Crozat who owned numerous properties throughout France including Chateau de Gaillon and Chateau de Fontainebleau which served as royal residences until 1730 when King Louis XV purchased them both from him along with numerous other properties he owned including Chateau Castille which became part of Louis XV and his wife Marie Leszczyńska's hunting trips while staying at Fontainebleau which became their principal residence while she acted as regent on behalf her young son King Louis XV after her husband died on September 14, 1723 during an epidemic which swept through France ending with her own death on October 7, 1725 . She was buried next to her husband beneath a simple tombstone instead of one covered with gilded sculptures like other members of French royalty . Their children were placed into care while their uncle Philippe II Auguste acted as regent until they reached adulthood .</p>\n<p>Louis XV and Marie Leszczyńska had four children: Philip (born January 29, 1725) who became king; Marie Adélaïde (born July 19, 1727); Louise Élisabeth (born July 10, 1728); and Henriette Anne (born May 5, 1732). On November 15, 1737 Marie Adélaïde married Victor Amadeus II Emmanuel , Duke of Savoy , a member of a cadet branch line whose family ruled over Sardinia . As part of their marriage agreement Victor Amadeus received several properties including Chateau Castile . It then became known as &quot;Chateau des Dames&quot; or &quot;Dames Castle&quot;. Marie Adélaïde would give birth here two daughters: Princess Victoire Thérèse Félicité born June 18 [O.S.] / July 1 [N.S.] ,1738 ; Princess Sophie Thérèse born July 14 / 23 [O.S.] ,1739 , six days after her father died leaving no male heirs meaning she would become Queen consort upon her mother's ascension since women could not ascend the throne at this time . After Queen Marie Adelaïde 's death April 28 / May 9 [O 11] ,1776 ; Her daughter Queen Sophie Thérèse moved back from Versailles back to Dames Castle where she died December 10 / 20 [O 11] ,1799 aged 58 without any surviving heirs .</p>\n<p>On April 25/ May 6 [O 11] ,1802 Eustache Lambert Edouard Lefebure bought Chateau des Dames From Marie Adelaïde 's widow Louise Joséphine Philippine Duchesse de Berry who also owned other properties around Paris including Hôtel Lambert built By Nicolas Ledoux around 1700 who left no heirs so Lefebure would be named adjutant general du district et président du conseil général des Vosges en 1814.. After Lefebure 's death November 2 / 12 [O 12] ,1807 ; Baron Edouard Clancey bought Dames Castle where he lived until 1840 when he sold it To Baron Henry Gustave David Gourgue Président du Conseil General des Vosges..</p>\n<p>On February 8/ 19 1842 Baron Henri Maurice Gourgue married Baronne Jeanne Suzanne Gourgue née Clancey widow Of Baron Joseph Gourgue Président du Conseil General des Vosges ; He assumed management Of Dames Castle but soon ran Into financial trouble due To poor harvests And expensive Hunting parties He organized So decided To sell Which led Him To buy another property closer To Paris So sold Dames Castle again On June 6/18 1842 This Time To Count Alexandre Joseph Henry Augustin Perregaux nobleman From Neuchatel Who took possession On November 13/ 24 O 12 At Which time Dame s castle Was renamed Castillo De Espira...Perregaux Built A small chateau out The front Which made up For His lack Of income From The vineyards located At The rear Of Chateaus That Were turned Into fields For grazing livestock Since Perregaux Now Inherited A large fortune Following His father s death In 1841 He decided To sell off Some Of His properties Including Des Espira And Bought another Property closer To Paris Which meant That Des Espiras Were once again left Empty Until It Was sold Again On December 28/ January 9 1853 This Time To Lord Albert Edward John Spencer - Cavendish 4th Duke Spencer head Of The Spencer family During Whose Reign As Duke Of Marlborough Des Espiras Would be Known As Spencer Castle...Lord Spencer Would Spend Several Months Each Summer Here While The rest Of His Seasons Were Spent At Althorp House In Northamptonshire Until 1897 When He Died Without Any surviving heirs Which meant That Des Espiras Would Be Sold Again This Time By Lady Georgiana Frances Spencer 7th Duchess Spencer Who Owned Other Properties Around England Including Althorp House Where She went With Her sons Upon Her Husband 's Death In 1921...she Put Des Espiras Up For Sale In 1921 But Did Not Find Any takers Until 1930 When She Sold It For £ 80 000[¤ 86 000 ]to Mme Simone Elisabeth Tereza Bauduin nee Romana Who Owned Several Properties Around Paris Including Hôtel Bourke - Piccoli Built By Charles Percier And Pierre François Léonard Fontaine Who Had Been Building A Mansion Alongside Engravings By Jean-Antoine Watteau At Mme Bauduins Request When She Acquired Bourke - Piccoli In 1930 From Raymond And Maurice Schlossberg...the House Was Completed In 1932 ;Mme Bauduin Took Up Residence But Due To Conflicts With Her Neighbors Over Issues</p>\n",
      "date_published": "2020-02-17T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-Shoreditch/",
      "url": "https://heyletsgo.casa/posts/Chateau-Shoreditch/",
      "title": "Chateau Shoreditch",
      "content_html": "<p><img src=\"../../img/city/pexels-lucas-pezeta-2352348.jpg\" alt=\"Chateau Shoreditch\"></p>\n<p>Chateau Shoreditch is a rustic Chateau in Shoreditch, London. It was built in the 19th century and served as a French Chateau in the English countryside. However, it was later abandoned by its owners and used to store garbage. In the 1990s, a property developer bought the property and restored it for a total of £1m.</p>\n<p>Chateau Shoreditch is a replica of the Chateau de Groussay, in France. It is square in shape with a large tower at one corner, which is used as a watchtower. Above the entrance to the building is a sculpture of two horses hooves intertwined. Above this are three shields bearing French royal symbols: &quot;fleur-de-lys&quot; and two lions holding &quot;fleur-de-lys&quot;. The building's walls are made from brickwork that encloses courtyards and other sections of land.</p>\n<p>The building stood on land that was originally part of Shoreditch House Estate until it was sold by Edward Solly in 1841 to Charles Fussell Palmer who commissioned architect Thomas Allom to design and build Chateau Shoreditch in 1866 at an estimated cost of £50,000 (). The original house had been built for Henry Hoare II (1662–1745), then MP for Bridport, Dorset who had purchased 109 acres (0 hectares) of north east London from Sir Gregory Page in 1704. Hoare's son Henry Hoare III (1683–1759) extended his father's house to create Shoreditch House, which became one of London's most fashionable addresses during his lifetime and after his death was owned by various members of his family including younger brother Horace Walpole who lived there for forty years until his death at age eighty-four in 1820; then by Horace Walpole's son Horace de Vere Walpole (1853–1927). The estate passed out of family ownership following Horace de Vere Walpole's death without heirs; over 1,200 lots were sold at auction by Messrs Puttick &amp; Simpson on 27 June 1928 pursuant to the terms set out in his will; Charles Fussell Palmer bought lot 42 which included all but three acres () of Shoreditch House estate including the site where Chateau Shoreditch was built later that year for £40,000 (). Charles Fussell Palmer died one year later aged fifty-seven without heirs so Chateau Shoreditch became the property of his widow Lady Alethea Palmer who lived there until her own death at age seventy-six on 8 February 1940 when her only surviving nephew Captain Maurice Henry Fussell Palmer inherited it through her will leaving him with £247 16s 6d () in probate duty (). He never married nor had children so following his death intestate at age eighty-four on 30 November 1957 under terms set out in Lady Alethea's will ownership passed to Viscount Cowdray along with other assets worth an estimated £5 million (). He left no heir when he died intestate four years later leaving Chateau Shoreditch worth around £1 million (). His wife Lady Katherine Cowdray made several unsuccessful attempts between 1962 and 1978 to sell off various assets including Chateau Shoreditch before she sold it off separately through Savills estate agents on 9 August 1980 for £1 million () to Peter Carwardine who lived there with his wife Sue until they divorced leaving him with just three acres () around Chateau Shoreditch which he called &quot;The Island&quot;; he leased part back to his ex-wife Sue allowing her continued access through what had become known as &quot;Sue's Tunnel&quot;.</p>\n<p>The neglected building fell into disrepair over several decades becoming known locally as &quot;Palmerston Tower&quot;, or more affectionately &quot;Shitty Castle&quot;, due mostly to its state having been left derelict for many years while also because some residents believed its presence blocked planning permission for development elsewhere within their neighbourhood; while some reports suggest that this nickname could simply be attributed instead simply because locals thought that Peter Carwardine named it himself after former British Prime Minister Lord Palmerston (1784–1865). However despite local opposition including vandalism during demolition attempts led by local residents' action groups like Friends of Pond Park (formed 1995) &amp; Save Pond Park &amp; Gardens (formed 1999), Carwardine failed on numerous occasions during 1988–2000 to get Westminster Council planning permission for redevelopment proposals which included converting Chateau Shoreditch into luxury flats featuring health spa facilities while also installing roof gardens onto flats within four surrounding Victorian era tenement buildings (), all directly overlooking Upper Clapton Pond itself - yet he still continued trying right up until shortly before his sudden death from heart failure at age sixty-eight on 25 October 2000 not long after returning from holidaying abroad - despite local residents claiming otherwise publicly claiming instead well before this time that they fully supported keeping this historic structure mostly intact rather than having it demolished &amp; replaced with modern blocks typical among many other buildings found throughout London urban area instead - although even then they'd still prefer something else entirely different instead since preserving such historic structures seems currently too much trouble even though doing so may actually help revitalise their community especially if done well along these lines as an example given their own neighbourhood here - if anything perhaps this could help explain why many residents chose not support restoration efforts as claimed or otherwise continue trying block any such efforts from being carried out now either though despite all those protest efforts Carwardine managed finally gain permission from Westminster Council nearly seven years earlier back on 4 April 1993 for conversion into luxury flats &amp; eventually managed apply successfully under Section 106 Part II Planning Obligations specifically clause 3(&quot;b&quot;)(iv) using Heritage Grant Aid funding towards restoring features such as public access stairways inside tower itself plus much needed major structural repairs outside + external landscaping improvements after agreeing upon buying back lots 1 &amp; 2 comprising 3 acres () around Chateau via separate deal(s) involving Peter Ashman Ltd., Savills Estate Agents Ltd., Sloane Stanley Estate Agents Ltd., Savernake Estates Ltd., Bracknell Estates Ltd., William Lamb Holdings Ltd., Grosvenor Property Services plc plus final agreement between them all eventually reached following auction held 2 July 1997 for undisclosed sum ; although this deal didn't include restoring main building itself since he still wanted sell/demolish if possible + since none could afford buy whole place outright nor would anyone take place offered price asking price £4m+/- so he kept trying find solution until finally got planning permission first time mentioned above ..... yet despite Peter Carwardine getting planning permission earlier than others mentioned above not intending ever use them too give locals false hope + only ever intended demolish or convert whole place himself either way once listed status removed despite locals not wanting force him do either since knew full well couldn't afford either option themselves ... Ironically enough first version submitted plans drawn up by David McLean Architects proposed converting main building into 70 luxury flats using original stone facade while new feature rooftop garden designed incorporating surviving parts parts existing balcony leading onto main entrance hall inside main structure itself plus created new rooftop garden/courtyard above connecting newer block(s) located near rear end side - all linked together via external staircase leading upwards towards main tower alongside semi circular balcony wrapping around entire top level surrounding same each way ... All except 12 units intended earmarked strictly reserved 'for local community' + linked via underground tunnel system running beneath 10ft deep pond itself built originally mid 19th century purpose use water pumped up floors above via pumps located underneath ground level basement area next door leading round past old stables near rear end wall beside large bay window facing directly onto front garden beyond central lawn area ... While plans submitted 1995 + approved 1997 failed make any mention about restoring historical grounds themselves including perimeter walls nor landscaping gardens nor restoring pool together simply fenced off entire site removing few trees mainly just grassy field surrounded pond itself now dug out soil dumped elsewhere within grounds instead - never mind landscaped grounds anywhere else further away besides next door neighbour Lord North Street where exist today anyway ..... Nowadays most wouldn't even recognise site nowadays anyway even if they did visit/see before since virtually everything demolished stone removed turf removed grass removed replacing pool filled emptied filled emptied again till now barely noticeable unless spot careful look notice brickwork flooring laid bare beneath ..... Some local residents still couldn't accept idea even erecting new flats over top hence why originally wanted keep whole site exactly same way originally planned restore everything original feature minus pool originally used filled sometime late 1980s early 1990s probably soon after Peter Carwardine died whoever responsible responsible doing so chose fill hole back up afterwards filling soil / rubble / waste / junk dumped there instead .... Such constant tampering demolition work slow progress inevitable eventually lead result demolition work stopped short short few feet short days short weeks short months</p>\n",
      "date_published": "2020-01-02T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Bristol/",
      "url": "https://heyletsgo.casa/posts/Inn-Bristol/",
      "title": "Inn Bristol",
      "content_html": "<p><img src=\"../../img/city/pexels-kai-pilger-591383.jpg\" alt=\"Inn Bristol\"></p>\n<p>Inn Bristol is a rustic inn with a very old feel. It has a lot of character and is in an area of the city that is not too crowded, but is close to downtown and all the major attractions. The rooms were clean and comfortable when we arrived. We stayed in two different rooms: one with two double beds and one with a single bed. Both were large enough and had enough space to store our suitcases and other things we needed for our stay. The breakfast was decent but could have been better. There is a nice porch that overlooks the river that we enjoyed sitting out on in the evenings, which was nice even though it was cooler than we would like because it had such a great ambiance. (Hotel guests get their own key to come and go as they please.) We did not use the pool or the hot tub, but it seemed like they were well-kept and utilized by many hotel guests at all hours of the day (and night). Overall, I think this is a good hotel with some room for improvement (the breakfast especially), but I would recommend staying here if you want something more unique than most hotels in this area of New Orleans.</p>\n",
      "date_published": "2019-12-29T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Grosso/",
      "url": "https://heyletsgo.casa/posts/Lodge-Grosso/",
      "title": "Lodge Grosso",
      "content_html": "<p><img src=\"../../img/jungle/pexels-jacob-colvin-1757363.jpg\" alt=\"Lodge Grosso\"></p>\n<p>Lodge Grosso is a jawdropping lodge set in the cloud forest of the Manu Biosphere Reserve, in the pristine Amazon. The lodge was designed by renowned architect Guy Holleran, who designed many of Peru’s most luxurious hotels. Every room has a private balcony with an expansive view of the surrounding jungle.</p>\n<p>The lodge covers 25,000 square meters and has 9 buildings, including a restaurant, bar, swimming pool, spa and even a hair salon. It also has its own airstrip for direct flights from Cusco or Lima.</p>\n<p>The rooms are sumptuous with elegant furnishings imported from Europe and artwork reflecting the surrounding forest life. The rooms are spacious over 100 square meters each with two queen-sized beds and include views of either the jungle or river below.</p>\n<p>Lodge Grosso was named one of the world’s top 10 hotels by Condé Nast Traveler in 2013 and one of the top 25 hotels in South America by Travel &amp; Leisure Magazine in 2012.</p>\n",
      "date_published": "2019-12-19T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Guest-House-Aqua-Beach/",
      "url": "https://heyletsgo.casa/posts/Guest-House-Aqua-Beach/",
      "title": "Guest House Aqua Beach",
      "content_html": "<p><img src=\"../../img/beach/pexels-nice-guys-767239.jpg\" alt=\"Guest House Aqua Beach\"></p>\n<p>Guest House Aqua Beach is a upscale guest house located in a very safe and private neighborhood of Nungwi, Zanzibar. We offer amazing rooms with ensuite bathrooms, 2 minutes from the beach. Our restaurant serves seafood and Indian cuisine.</p>\n<p>The staff is very friendly and helpful, they can help us organize any excursion, advise on local activities or simply make us feel at home. The villa has a large pool surrounded by palm trees and a bar where you can relax after a day in the sun.</p>\n<p>Aqua Beach is only 50 meters from the beach and 100 meters from the bus stop that will take you to the town center or the airport in 10 minutes. Nungwi is a small village that lies within a reef which offers beautiful water activities such as snorkeling, diving and fishing excursions. Our restaurant serves fresh seafood caught in front of your eyes with lobster being our specialty! In addition to eat at our restaurant you will receive 15% off all food orders when having accommodation at Aqua Beach Guest House! We have an amazing rooftop bar where you can chill out after a day in the sun with your favorite cocktail!</p>\n",
      "date_published": "2019-09-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Private-Island-Sunset-Dream/",
      "url": "https://heyletsgo.casa/posts/Private-Island-Sunset-Dream/",
      "title": "Private Island Sunset Dream",
      "content_html": "<p><img src=\"../../img/beach/pexels-pok-rie-6726937.jpg\" alt=\"Private Island Sunset Dream\"></p>\n<p>Private Island Sunset Dream is a sophisticated private island on the tropical Island of Gili Air, which is located in the south of Lombok, Indonesia. The island has a natural white sand beach and crystal clear water.</p>\n<p>This island is the perfect place for a romantic and secluded honeymoon. It can accommodate up to 10 people and offers a private pool and spacious living areas, which make it ideal for families or corporate groups. There are three spacious bedrooms that contain four large beds with mosquito nets. The master bedroom includes an en-suite bathroom with shower and toilet. Each bedroom is furnished with a wardrobe, king-size bed (or two twin beds) and comfortable chairs.</p>\n<p>The kitchen is fully equipped with all the modern amenities including a refrigerator, stove, microwave oven, kettle coffee maker, toaster and dinnerware set. There is also a dining table for eight people in the living area with breakfast bar where you can enjoy your meals while enjoying the view of Gili Air from your private terrace or sunroom. You will have access to WiFi Internet connection on this island so you can stay connected while you're relaxing on your holiday retreat in Indonesia.</p>\n<p>The private pool on this island offers you many opportunities for relaxation after a long day exploring the wonderful local attractions in Lombok or visiting nearby islands such as Gili Meno or Gili Trawangan islands with its famous Blue Lagoon swimming spot with its spectacular view of the sunset over the Indian Ocean!</p>\n",
      "date_published": "2019-07-25T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-Cipriani/",
      "url": "https://heyletsgo.casa/posts/Chateau-Cipriani/",
      "title": "Chateau Cipriani",
      "content_html": "<p><img src=\"../../img/city/pexels-lucas-pezeta-2352348.jpg\" alt=\"Chateau Cipriani\"></p>\n<p>Chateau Cipriani is a sophisticated Chateau style hotel located in the exclusive &quot;Billionaires' Row&quot; area of the city, on East Amherst Avenue. This is an exclusive neighborhood with home prices ranging from $20 million to over $100 million.</p>\n<p>The property was originally built in 1925 by famed architect Stanford White for William K. Vanderbilt II, the great-grandson of Cornelius Vanderbilt, who established the New York Central Railroad. The estate was later sold to Richard Hoyt-Vanderbilt, in 1937, whose family owned it until 1987 when they sold it to Rolf Sachs and his wife. Sachs had a vision to restore the property back to its original grandeur and hired Italian architect Annamaria Cipriani (no relation) and designer Jack Lenor Larsen to redesign and decorate the property into a luxurious five star hotel and restaurant. After six years of extensive renovations, Chateau Cipriani opened its doors as a luxury hotel and restaurant on December 13, 1993. The French chateau style mansion was listed on the National Register of Historic Places in 1989 as part of its Beaux-Arts architecture theme.</p>\n",
      "date_published": "2019-07-11T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-Chiang-Mai/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-Chiang-Mai/",
      "title": "Safari Camp Chiang Mai",
      "content_html": "<p><img src=\"../../img/jungle/pexels-teguh-sugi-6121916.jpg\" alt=\"Safari Camp Chiang Mai\"></p>\n<p>Safari Camp Chiang Mai is a breathtaking safari camp set in the heart of Chiang Mai. Located only a few minutes from the airport, this camp is a fantastic venue for those who want an authentic safari experience with over 40 animals to see including meerkat, deer, snakes and many more.</p>\n<p>Safari Camp Chiang Mai also offers special experiences for two of Chiang Mai’s most loved creatures; Red Pandas and Gibbons. Visitors can get up close to these cute creatures in their natural habitat, eat your own private picnic by the river or relax at their swimming pool.</p>\n",
      "date_published": "2019-06-29T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Palace-Cipriani/",
      "url": "https://heyletsgo.casa/posts/Palace-Cipriani/",
      "title": "Palace Cipriani",
      "content_html": "<p><img src=\"../../img/city/pexels-leah-kelley-952586.jpg\" alt=\"Palace Cipriani\"></p>\n<p>Palace Cipriani is a rustic palace located in the heart of Venice. The hotel was built in the 1800’s and it is now a 5 star hotel with a casino and a breathtaking restaurant (La Terrazza, rated as one of Italy’s best restaurants). You can also find shops, a swimming pool, a small casino and two meeting rooms.</p>\n<p>Palace Cipriani is located just steps from Saint Mark’s Square and provides guests with great access to all there is to see and do in the historic center of Venice.</p>\n<p>Palace Cipriani has been beautifully restored giving it a modern luxury feel while retaining all the charm of Venice.</p>\n<p>There are only 16 suites at Palace Cipriani so you can rest assured that you will not be sharing your hotel room with 50 other people. Each room has a different theme, our room had a grand piano that doubled as the writing desk, I loved it! The bedroom also had an original fireplace that was converted into an electric fireplace which was fantastic for those chilly winter nights. We had to leave the window open as it was very cold but luckily we didn’t have any problems with noise as we were on the first floor.</p>\n<p>The bathroom was beautiful with beautiful marble flooring and sinks. The bathtub was gorgeous but unfortunately we didn’t have time to use it! That is one thing I really miss when I go backpacking – hot showers! But I guess you will have to make time for them when staying at Palace Cipriani! We did enjoy breakfast every morning on their rooftop terrace which had 360 degree views of Venice – breathtaking!!! Breakfast was served until 11:00 am so if you wanted to sleep in you could all day long! The breakfast included fresh fruit platters, pastries, sausage and bacon (you could also order eggs) – all delicious!! There was also fresh coffee and orange juice available all day long! Oh yeah – we loved this place!!</p>\n",
      "date_published": "2019-04-06T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-Ubud/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-Ubud/",
      "title": "Safari Camp Ubud",
      "content_html": "<p><img src=\"../../img/jungle/pexels-teguh-sugi-6121916.jpg\" alt=\"Safari Camp Ubud\"></p>\n<p>Safari Camp Ubud is a breathtaking safari camp set deep in the jungle of Bali. The resort is surrounded by a lush tropical garden and is just a few hours away from the city. As a part of the Bali Safari &amp; Marine Park, guests can enjoy safari-themed activities such as elephant riding, jeep safari and canoeing through the swamps. The resort offers different accommodation options such as family rooms, bungalows and villas. All rooms are spacious and decorated with traditional Balinese elements. Guests at Safari Camp Ubud can enjoy breakfast and dinner at its restaurant and bar, which offers international dishes as well as Indonesian cuisine.</p>\n<p>Safari Camp Ubud is a truly fantastic place to experience nature and wildlife up close. With its luxurious accommodation and beautiful scenery, it is no wonder that this hotel was awarded TripAdvisor Travellers' Choice 2017 award for most popular hotel in Indonesia!</p>\n",
      "date_published": "2019-04-02T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-Bristol/",
      "url": "https://heyletsgo.casa/posts/Chateau-Bristol/",
      "title": "Chateau Bristol",
      "content_html": "<p><img src=\"../../img/city/pexels-felix-haumann-3626248.jpg\" alt=\"Chateau Bristol\"></p>\n<p>Chateau Bristol is a charming Chateau located in Loches, Indre-et-Loire, France. It is one of the Loire Valley’s more attractive Chateaux.</p>\n<p>The house was built in 1515 by Jacques d’Amboise, more than likely on the site of an earlier castle. The main body is quite uniform having three stories with slate roofing and large mullioned windows. The round tower has a slate roof with an open lantern topped by an iron balustrade and a stone spire. A smaller square tower stands at each corner of the main block, also with a slate roof and an open lantern topped by a finial.</p>\n<p>The Chateau was purchased in 1604 by Maurice de Bourbon, Duc de Mercoeur but he died shortly thereafter and it then passed to his daughter Marie de Bourbon who became Duchess of Mercœur when she married Henri II d’Orléans in 1607. In 1608 her husband began renovations which included adding a much larger wing onto the north end of the original building, adding dormer windows to the top floor, and extending the cellars beneath the ground floor to accommodate his large wine collection which he had begun collecting in 1603 when he purchased Chateau du Clos-Lucé in Amboise from Leonardo da Vinci for 100 000 livres after hearing that he was going blind. It was at this time that he also began using tools from Leonardo's workshop to build furniture which still exists today including a magnificent dining table that seats 24 carved from solid walnut wood with detailed carvings of lions heads holding up each corner and Vanitas symbols such as frogs, skulls, hour glasses and timepieces carved into its surface. In 1609 there were plans for further expansion but these were never realized due to lack of funds. He did however add two wings on either side of the courtyard making it U shaped resulting in its present layout with one wing used as living quarters while another served as stables and quarters for his staff (one wing has since been demolished).</p>\n<p>In 1815 Chateau Bristol passed into private ownership when it was purchased by Henri Drouin de Lhuys who added two large wings onto either side of the courtyard giving it its current U-shaped layout (the wings were demolished in 1902). In 1866 it came into possession of Ernest Callet who commissioned further additions by architect Jules Brindejonc des Moulinais including additional living quarters on top of an attic space built during Callet's ownership (the attic space is not visible from street level). During this time period Callet installed fountains and brought back garden terraces around the Chateau which had been removed during previous renovations done under Drouin de Lhuys' ownership (these terraces can be seen today behind trees that line both sides of rue du Chateau). In 1920 Louis Blain bought Chateau Bristol but did not live there for long before renting out most rooms to wealthy tenants until his death in 1941 when it became state property until 1944 when it was sold once again to Edmond Sautter who lived there until 1950 before renting out rooms again until 1960 when he died leaving his wife Andrée Sautter as sole owner who lived there until her death in 1972 after which her son inherited ownership before selling it again to Gérard Castelot-Notrejean who owned Chateau Bristol until 1989 when he sold it once again leaving its current owners Michel Rousselot &amp; Marie-France Rousselot - De la Houssaye as current owners since 1990 after purchasing Chateau Bristol for 1 million francs.</p>\n",
      "date_published": "2019-03-26T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Cipriani/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Cipriani/",
      "title": "Hotel and Spa Cipriani",
      "content_html": "<p><img src=\"../../img/city/pexels-felix-haumann-3626248.jpg\" alt=\"Hotel and Spa Cipriani\"></p>\n<p>Hotel and Spa Cipriani is a rustic Hotel and Spa on the island of Giudecca, in Venice, Italy. It is located on the same island as the historic Palazzo Cipriani and next to the Giardini Pubblici, one of Venice's largest parks. Cipriani Hotel and Spa comprises a total of 73 rooms and suites spread over three historical palazzos. The first hotel was built by Giuseppe Cipriani (1872–1927) on his own family estate at Ca' Cipriani on Giudecca in 1914. The hotel was sold to Sheraton in 1966 and reopened as a Sheraton Hotel; it was closed again in 2001 and reopened as a hotel and spa by Harry's Bar proprietor Giuseppe Cipriani (1928–2011), grandson of the first owner.</p>\n<p>The works carried out by the third generation have been able to fully restore all that was lost over time: to bring back life to its glorious past , using only authentic materials, following the path traced out by his grandfather Giuseppe Cipriani, who made his dreams come true with determination, passion and love for his country .</p>\n",
      "date_published": "2019-03-10T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Providence/",
      "url": "https://heyletsgo.casa/posts/Hotel-Providence/",
      "title": "Hotel Providence",
      "content_html": "<p><img src=\"../../img/city/pexels-zachary-debottis-1838640.jpg\" alt=\"Hotel Providence\"></p>\n<p>Hotel Providence is a stylish hotel in the heart of downtown Providence. It has a very hip and stylish bar, and a great restaurant (irish pub type food with a selection of microbrews). We ate there for breakfast and it was very tasty. Everyone in our group was incredibly impressed with how nice this hotel was. Staff were friendly and helpful, and they had really nice monogrammed robes in the rooms. The lobby and bar area is very hip and cool, with lots of vintage elements to it. Comfortable beds, nice linens, beautiful bathroom - we all loved this place!</p>\n",
      "date_published": "2019-03-04T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Chiang-Mai/",
      "url": "https://heyletsgo.casa/posts/Lodge-Chiang-Mai/",
      "title": "Lodge Chiang Mai",
      "content_html": "<p><img src=\"../../img/jungle/pexels-teguh-sugi-6121916.jpg\" alt=\"Lodge Chiang Mai\"></p>\n<p>Lodge Chiang Mai is a rustic lodge located in Hang Dong, Chiang Mai. It is a great lodge for those who want to experience the real local life of Chiang Mai.</p>\n<p>This lodge is located in a small village within Chiang Mai Province. It is not far from the city of Lamphun, about 15 kilometers away. Guests have easy access to nearby attractions, including Doi Suthep Temple, Wat Phra That Doi Suthep, and Wat Huay Mongkol. This hotel is also situated near Doi Inthanon National Park, which is one of the most beautiful parks in Thailand.</p>\n",
      "date_published": "2019-01-27T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Puerto-Maldonado/",
      "url": "https://heyletsgo.casa/posts/Camp-Puerto-Maldonado/",
      "title": "Camp Puerto Maldonado",
      "content_html": "<p><img src=\"../../img/jungle/pexels-james-wheeler-1534057.jpg\" alt=\"Camp Puerto Maldonado\"></p>\n<p>Camp Puerto Maldonado is a magical camp. It is located on the banks of the Madre de Dios river, which is itself a tributary of the Amazon river, just after it has exited the Tambopata reserve.</p>\n<p>The river itself is very still and quiet at this point, but parallel to it are some excellent stretches of water for theming.</p>\n<p>A few minutes walk away are the tributaries that enter into the main river, which are perfect for white water rafting. This is a great camp for anyone looking to do some kayaking on some of the best rivers in South America.</p>\n<p>The location itself is absolutely stunning. There are some breathtakingly beautiful views throughout this camp with birds singing in the surrounding trees, monkeys swinging through them and calling out, and all sorts of other wildlife for you to look out for as you explore your surroundings.</p>\n<p>Accommodation is very good with private rooms inside modern cabins with comfortable beds and more than enough space to have your belongings around you while you are not using them. The bathrooms are attached to each cabin so your privacy will always be protected! The cabins have mosquito nets on their windows so you can leave them open all night if you want without being bitten by any insects!</p>\n<p>There is also an excellent restaurant with a wide variety of delicious food on offer including an amazing breakfast that will give you energy for your activities all day long!</p>\n",
      "date_published": "2019-01-25T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Paradise-Beach/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Paradise-Beach/",
      "title": "Hotel and Spa Paradise Beach",
      "content_html": "<p><img src=\"../../img/beach/pexels-asad-photo-maldives-3155661(1).jpg\" alt=\"Hotel and Spa Paradise Beach\"></p>\n<p>Hotel and Spa Paradise Beach is a rustic Hotel and Spa offering a casual atmosphere and spacious rooms with views of the sea or garden. The property features a restaurant, bar, free parking, and free Wi-Fi.</p>\n<p>Everything was great. Perfect service (thanks to the manager). Very nice breakfast. Big room with excellent view. Nice garden to relax after spending time at the beach. Good location - close to the sea but not in the very centre of Zakynthos city (there are much more bars and restaurants there).</p>\n",
      "date_published": "2019-01-13T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Kensington/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Kensington/",
      "title": "Hotel and Spa Kensington",
      "content_html": "<p><img src=\"../../img/city/pexels-alexander-kovalev-2371016.jpg\" alt=\"Hotel and Spa Kensington\"></p>\n<p>Hotel and Spa Kensington is a stylish Hotel and Spa set in an elegant Victorian building. It is just one five-minute walk away from Kensington Palace and Hyde Park. The hotel offers free Wi-Fi access, free parking with disabled spaces, 24-hour front desk.</p>\n<p>The breakfast was good, the room was clean and nice, the staff were friendly. - The staff were very helpful and accommodating. They also had a complementary shuttle service to the tube station which was very useful.</p>\n<p>We spent our 10th wedding anniversary here and loved it! The hotel is small but very nice and with nice details; the beds are very comfortable; the breakfast is great; our room had a view to the palace grounds. I would definitely recommend this place - It's not expensive either!</p>\n",
      "date_published": "2019-01-09T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-Bristol/",
      "url": "https://heyletsgo.casa/posts/Suites-Bristol/",
      "title": "Suites Bristol",
      "content_html": "<p><img src=\"../../img/city/pexels-daniel-frank-323311.jpg\" alt=\"Suites Bristol\"></p>\n<p>Suites Bristol is a charming suites hotel in Bristol. The hotel features a sun terrace and a seasonal outdoor pool.</p>\n<p>This business hotel is located in the heart of Bristol, just one block from the railway station. It lies within a 5-minute walk of Arnolfini Center for Contemporary Art.</p>\n<p>Somerset House, Lloyds Amphitheatre and Royal West of England Academy are situated around 20 minutes' walk away.</p>\n<p>Suites Bristol Hotel offers 25 rooms fitted with climate control, a laptop-compatible safe, multi-channel television, coffee/tea makers and a dressing area for a comfortable stay in Bristol. They also comprise en suite bathrooms appointed with a hairdryer and a shower.</p>\n<p>Breakfast is offered in the dining area every morning. A rich buffet breakfast is served at the restaurant on site every morning. Guests can dine at The Junction located within walking distance from the property.</p>\n",
      "date_published": "2018-12-20T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Shoreditch/",
      "url": "https://heyletsgo.casa/posts/Hotel-Shoreditch/",
      "title": "Hotel Shoreditch",
      "content_html": "<p><img src=\"../../img/city/pexels-min-an-1006105.jpg\" alt=\"Hotel Shoreditch\"></p>\n<p>Hotel Shoreditch is a sophisticated hotel, located in the heart of East London, a stones throw from Shoreditch High Street and a few minutes walk from Old Street Tube Station. The hotel is a member of the Small Luxury Hotels of the World and has just undergone a major renovation. The rooms have been completely refurbished and are modern, chic and cool with great views of either Shoreditch High Street or the City.</p>\n<p>The hotel is part of the Merchant Square development which was established in 2005 as an architectural statement to be proud of. The development consists of four buildings, one of which hosts Hotel Shoreditch, two residential properties and a suite of shops.</p>\n<p>The hotel has a stunning lobby with a library-style main reception where you’ll be welcomed with hot drinks by concierge staff. If you’re checking in before 12pm then you can take advantage of their complimentary breakfast to get your day off to an energised start.</p>\n<p>A selection of complimentary newspapers are available for guests on arrival, as well as local magazines showcasing the East End’s best attractions. You can sit back with your newspaper or book yourself into one of several nearby restaurants for dinner that evening – there’s plenty to choose from!</p>\n",
      "date_published": "2018-12-18T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Sandy-Dunes/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Sandy-Dunes/",
      "title": "Hotel and Spa Sandy Dunes",
      "content_html": "<p><img src=\"../../img/beach/pexels-alexandr-podvalny-319892.jpg\" alt=\"Hotel and Spa Sandy Dunes\"></p>\n<p>Hotel and Spa Sandy Dunes is a spiritual Hotel and Spa that I’d recommend to anyone looking for peace and rest, and who loves the outdoors.</p>\n<p>The hotel and Portland offer a nice variety of activities for nature lovers, including kayaking, diving and hiking. The spa is rated as one of the top spas in the Caribbean.</p>\n<p>On my next visit I’ll definitely try the kayak tours, snorkeling and diving. The hotel also has a beach bar which we didn’t visit but I heard it was very nice.</p>\n",
      "date_published": "2018-12-12T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Gritti-Palace/",
      "url": "https://heyletsgo.casa/posts/Hotel-Gritti-Palace/",
      "title": "Hotel Gritti Palace",
      "content_html": "<p><img src=\"../../img/city/pexels-maria-orlova-4947281.jpg\" alt=\"Hotel Gritti Palace\"></p>\n<p>Hotel Gritti Palace is a rustic hotel with an old-world feel, located in the heart of Venice. It offers free Wi-Fi and elegant rooms with classic decor.</p>\n<p>Hotel Gritti Palace is located 400 metres from Piazza San Marco. The bus stop for buses to the Marco Polo airport is a 5-minute walk away. Santa Maria del Giglio Metro Station can be reached in 10 minutes on foot.</p>\n<p>Rooms at Hotel Gritti Palace are decorated in a classic style with wooden floors and parquet flooring. They all feature a private bathroom with a shower and hairdryer, as well as a minibar and cable TV.</p>\n<p>Guests of Hotel Gritti Palace can enjoy a buffet breakfast on weekdays, while snacks and cocktails are served at the bar of the hotel every evening. The Rialto Bridge is within walking distance from here, while restaurants serving Italian cuisine can be found just 50 metres away from the property.</p>\n<p>The famous La Fenice Theatre is just 100 metres from Hotel Gritti Palace, while Saint Mark's Square is 800 metres from the hotel.</p>\n",
      "date_published": "2018-11-20T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Yasuni-National-Park/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Yasuni-National-Park/",
      "title": "Ecolodge Yasuni National Park",
      "content_html": "<p><img src=\"../../img/jungle/pexels-bianca-1560065.jpg\" alt=\"Ecolodge Yasuni National Park\"></p>\n<p>Ecolodge Yasuni National Park is a rustic ecolodge located in the heart of the Yasuni National Park, Ecuador. The lodge is surrounded by primary rainforest and is only accessible by boat.</p>\n<p>The lodge was built with local materials and is powered by solar panels and a small wind turbine. It has 2 double rooms and 2 suites, which sleep between 3-5 people each. It has a large deck and dining area overlooking the river and forest, as well as a smaller deck located above the kitchen with views to the forest canopy.</p>\n<p>It is one of only two lodges in the Yasuní National Park; we visited both, we liked this one much better than Tinkuy Ecolodge because it felt more remote (although they are both located inside the national park), had better food (the chef at Tinkuy was not very good) and because there were more activities available (for example Kayaking).</p>\n<p>Tours can be booked through either lodge; we used Viveros Ecoturisticos for our tour to Tiwai Island.</p>\n",
      "date_published": "2018-11-18T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Grosso/",
      "url": "https://heyletsgo.casa/posts/Ranch-Grosso/",
      "title": "Ranch Grosso",
      "content_html": "<p><img src=\"../../img/jungle/pexels-renzy-atibagos-3377320.jpg\" alt=\"Ranch Grosso\"></p>\n<p>Ranch Grosso is a breathtaking ranch located in the foothills of the San Ysidro Mountains. The ranch features a 3,000 sq ft main home, a separate guest house and a pool house/game room. A private gated entrance leads to a beautiful oak tree lined driveway with several large oak trees. The driveway leads up to the front of the main house with a large circular drive and an outdoor living area which is perfect for entertaining. The main home has 5 bedrooms, 4 bathrooms and is over 5000 sq ft. This dream home has been custom designed with every detail considered from top to bottom including gorgeous hand painted walls, hand painted ceilings, custom cabinetry and furniture throughout the house as well as exquisite lighting fixtures from Baccarat Crystal of France throughout! The home has high ceilings that are 12 feet tall throughout the house.The main floor features an entry foyer that leads into an open living room/dining room area that is perfect for entertaining family and friends. A spacious kitchen with top of the line stainless steel appliances including 6 burner gas stovetop, convection oven, double ovens, coffee maker, blender and ice maker is also featured on this floor along with plenty of cabinets for storage! There are 3 bedrooms on this floor including 2 master bedrooms each with their own private bathrooms! The master bedroom located at the front of the house has French doors leading out onto an outdoor deck overlooking the property which is perfect for taking in some sunsets while enjoying your evening cocktail or coffee! The master bathroom features two walk-in shower stalls along with built-in vanities in both showers!The upper level features 2 additional bedrooms along with another full bathroom. One additional bedroom features French doors leading out onto its own balcony while another bedroom has French doors leading out onto yet another balcony overlooking Rancho Grosso’s rolling hillsides!The lower level of this amazing property offers additional space to spread out! There are two separate living areas on this level along with another full bathroom complete with whirlpool tub! The lower level also offers entertainment space including a game room complete with pool table and theater room complete with projector screen TV. A full bar area makes this downstairs space perfect for entertaining guests or enjoying your favorite beverage while watching your favorite movie or sports event after a long day on the ranch!This property also offers so many possibilities to further enhance its beauty by adding guest houses, barns or even raise horses or cattle along side all of its other amenities listed above! This is truly one of San Diego County’s most spectacular properties boasting magnificent views in every direction!The owner was inspired by his love for movies when he designed this property which includes many hidden rooms throughout making it truly one-of-a-kind in terms of architecture design. This property truly has it all…stunning views, beautiful architecture &amp; design &amp; plenty of space to enjoy all that Rancho Grosso has to offer year round including summer fun at Lake Jennings which is only 4 miles away (you can see Lake Jennings from some hilltops on Rancho Grosso) as well as year round hiking &amp; riding trails found right outside your door step &amp; tons more activities only minutes away in Julian &amp; Ramona</p>\n",
      "date_published": "2018-11-10T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-Sunset-Dream/",
      "url": "https://heyletsgo.casa/posts/Suites-Sunset-Dream/",
      "title": "Suites Sunset Dream",
      "content_html": "<p><img src=\"../../img/beach/pexels-pok-rie-6726937.jpg\" alt=\"Suites Sunset Dream\"></p>\n<p>Suites Sunset Dream is a jawdropping suites resort located in the Cancun Hotel Zone, a 5-minute drive from the beach and a 15-minute drive from downtown Cancun. The hotel offers free Wi-Fi and a rooftop terrace with a spa.</p>\n<p>Suites Sunset Dream features spacious suites equipped with air conditioning, satellite TV and a kitchen. They include an outdoor terrace or balcony with views of the gardens and swimming pool.</p>\n<p>The onsite restaurant serves local and international cuisine. Guests can unwind at the bar serving drinks in the evening. There is also an in-suite mini bar in every suite.</p>\n<p>Guests can relax in one of the 3 spa treatment rooms or enjoy a relaxing massage by the poolside gazebo. A gym is also available for guests’ use. Onsite car rental services are available upon request at no extra cost.</p>\n",
      "date_published": "2018-10-16T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Zighy-Bay/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Zighy-Bay/",
      "title": "Hotel and Spa Zighy Bay",
      "content_html": "<p><img src=\"../../img/beach/pexels-asad-photo-maldives-240514.jpg\" alt=\"Hotel and Spa Zighy Bay\"></p>\n<p>Hotel and Spa Zighy Bay is a jawdropping Hotel and Spa of a different kind. Located on a private island, it’s a very exclusive getaway with a distinctive design.</p>\n<p>The hotel is located in the Zighy Bay, between Abu Dhabi and Dubai in the United Arab Emirates. It’s one of the most luxurious hotels in the world, and it’s also one of the most expensive hotels in Abu Dhabi (if not in UAE).</p>\n<p>Accommodation at this Hotel and Spa is basically only available for residents with spacious and luxurious villas/villas and suites available for guests. The rooms are completely private, and they also come with private pools.</p>\n<p>Zighy Bay Hotel and Spa: Location and How to Get There?</p>\n<p>The Zighy Bay Hotel and Spa is located within an exclusive island resort in Abu Dhabi. The resort is located between Abu Dhabi city and Dubai city, so if you’re planning to visit this hotel from Dubai or Abu Dhabi city, you should know that it will take around 2-3 hours by car to get there from either of these cities.</p>\n<p>If you want to go by public transport/car/etc., you can either take the E11 road from Dubai or Al Ain towards Abu Dhabi, or take the E11 road from Abu Dhabi towards Dubai via Al Ain. Both routes will take you to Zighy Bay:</p>\n",
      "date_published": "2018-10-14T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Aqua-Beach/",
      "url": "https://heyletsgo.casa/posts/Hotel-Aqua-Beach/",
      "title": "Hotel Aqua Beach",
      "content_html": "<p><img src=\"../../img/beach/pexels-asad-photo-maldives-1591363(1).jpg\" alt=\"Hotel Aqua Beach\"></p>\n<p>Hotel Aqua Beach is a jawdropping hotel, located at the shores of one of the country's most beautiful beaches. It was the first hotel in the country to be certified as a five star hotel by the international organization, 'Leading Star'.</p>\n<p>The hotel is built on a hill and is surrounded by a lush tropical garden and has an amazing view over Pinar del Rio and Havana. The huge swimming pool is surrounded by palm trees and overlooks the Gulf of Mexico. The hotel has a total of 262 rooms, all with private balcony or terrace, air-conditioning, satellite television, safes, direct dial telephone and mini bar. There are 3 restaurants which serve Cuban as well as international cuisine. The hotel also has two bars and two tennis courts.</p>\n",
      "date_published": "2018-10-04T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Naladhu/",
      "url": "https://heyletsgo.casa/posts/Hotel-Naladhu/",
      "title": "Hotel Naladhu",
      "content_html": "<p><img src=\"../../img/beach/pexels-jasmine-ortega-4060149.jpg\" alt=\"Hotel Naladhu\"></p>\n<p>We stayed at Naladhu for one night in October 2013 and had a wonderful experience! The hotel is in a nice location just outside of the main part of town, about 20 minutes walk to the temple complex and 15 minutes to town center with lots of shops and restaurants along the way. I believe it's also about 15 minutes walk to other parts of town so it's convenient location wise as well. We arrived late evening after spending some time at one of Ayurveda resorts so we were tired but still enjoyed our stay at Naladhu! Our room was very clean and large with all amenities needed including sitting area/balcony which had nice seating area with seating looking out to garden below. We also enjoyed sitting outside on patio just off lobby just relaxing after long day walking around town! Staff were all very nice and helpful as well!! Would definitely recommend this hotel for your visit to Kerala!!</p>\n",
      "date_published": "2018-08-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Mashpi/",
      "url": "https://heyletsgo.casa/posts/Lodge-Mashpi/",
      "title": "Lodge Mashpi",
      "content_html": "<p><img src=\"../../img/plains/pexels-rachel-claire-4577147.jpg\" alt=\"Lodge Mashpi\"></p>\n<p>Lodge Mashpi is a rustic lodge perched on a cliff overlooking the rushing water of the Rio Mashpi. It has three rooms, all with private bathrooms and hot water. The rooms are wood-floored and decorated with hand-carved furniture; those in the main building have views of the river below. Lodge rooms share a large open-air dining area and kitchen.</p>\n<p>This comfortable hotel has 20 spacious, elegant rooms with wooden floors and traditional furnishings, including carved wardrobe closets and four-poster beds draped in mosquito nets. There's a pleasant common area with views of the lush gardens and river below, as well as an inviting restaurant (mains S22 to S30).</p>\n",
      "date_published": "2018-08-13T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Sant-Andrea/",
      "url": "https://heyletsgo.casa/posts/Inn-Sant-Andrea/",
      "title": "Inn Sant Andrea",
      "content_html": "<p><img src=\"../../img/city/pexels-andrew-neel-3201765.jpg\" alt=\"Inn Sant Andrea\"></p>\n<p>Inn Sant Andrea is a sophisticated inn, nestled within the historical center of Siena. It offers a warm and welcoming reception, with its staff eager to serve you and ensure you have a pleasant visit. The luxurious rooms are furnished with period furniture, while the bathrooms are all equipped with shower. There is free Wi-Fi throughout the building.</p>\n<p>The restaurant serves local dishes in a setting that is both elegant and refined. The chef has worked in some of the best restaurants in Italy, offering an excellent Mediterranean cuisine at affordable prices.</p>\n<p>The hotel is within an easy walk of the train station, in the heart of Siena's historic center. You can walk to Piazza del Campo in about 10 minutes. The Cathedral is only 100 meters away from the hotel, while Palazzo Pubblico is just 150 meters away.</p>\n",
      "date_published": "2018-08-05T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Paradise-Beach/",
      "url": "https://heyletsgo.casa/posts/Hotel-Paradise-Beach/",
      "title": "Hotel Paradise Beach",
      "content_html": "<p><img src=\"../../img/beach/pexels-maahid-photos-4366460.jpg\" alt=\"Hotel Paradise Beach\"></p>\n<p>Hotel Paradise Beach is a stylish hotel in Bali. The hotel lies 10 km away from Museum Garuda Wisnu Kencana.</p>\n<p>The city center is 10 minute walking distance from the hotel. The venue is located 27 km from the city center.</p>\n<p>The hotel offers 52 rooms including Deluxe Double Room, Deluxe Room and Family Double Room that are fitted with climate control, a safe, TV, a fridge and a separate toilet as well as en suite bathrooms with showers and bath sheets. They also comprise private bathrooms appointed with a shower and complimentary toiletries.</p>\n",
      "date_published": "2018-06-30T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-St-Pauls/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-St-Pauls/",
      "title": "Hotel and Spa St Pauls",
      "content_html": "<p><img src=\"../../img/city/pexels-justin-hamilton-205342.jpg\" alt=\"Hotel and Spa St Pauls\"></p>\n<p>Hotel and Spa St Pauls is a electric Hotel and Spa situated in the heart of downtown Victoria. The hotel is located near many attractions such as the Royal BC Museum, Beacon Hill Park and the beautiful inner harbour.</p>\n<p>The hotel is a 3 story building with beautifully decorated rooms. The rooms are well furnished and furnished with quality bedding and linens. Each room has a private bath, hairdryer, cable tv, telephone, clock radio &amp; coffee maker. The rooms are newly renovated with modern amenities &amp; plasma tv's. All this makes for an enjoyable stay in Victoria.</p>\n",
      "date_published": "2018-06-16T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Private-Island-Paracas/",
      "url": "https://heyletsgo.casa/posts/Private-Island-Paracas/",
      "title": "Private Island Paracas",
      "content_html": "<p><img src=\"../../img/beach/pexels-jess-loiterton-5006981.jpg\" alt=\"Private Island Paracas\"></p>\n<p>Private Island Paracas is a spiritual private island in Peru. It’s the last and only coastal remains of the giant sand dunes that used to cover most of the South American coastline. The surrounding sea is a translucent turquoise and the water is warm and clean. There are crystal clear waters and gorgeous sunrises. The island has an amazing archaeological site called Cerro Colorado which you can visit for free.</p>\n<p>The area is full of wildlife such as foxes, birds, deer, lizards, flamingos and iguanas. There are also huge numbers of fish here so it’s a great place to go fishing or snorkelling in the sea. You can find some very special and rare species here such as sea lions and dolphins (although they keep their distance). One of the best features is that there are no sharks in this area! If you want to relax with your loved one this location is perfect for you. It will make for an unforgettable experience filled with romance, tranquility and peace.</p>\n<p>There are several retreats on Isla de la Plata but one which stands out from all others is Adalberto Madrigal’s Casa Madrigal retreat (Casa Madrigal), where you will find peace, serenity, comfort, privacy, excellent food (vegetarian options) along with exquisite service (private chef at your service) at reasonable prices (less than US$70 per night per person). They have accommodation options including tipis for couples or family groups to cabanas where you can spend time alone or with your family or friends. The tipis come with mattresses but you need your own sleeping bags (you can rent them there at a low price). The cabanas include beds but it’s good to bring your own sleeping bags if possible because they don’t give blankets (it gets cold at night). You can also rent tents to bring if needed. There are two hot water showers on-site at each accommodation options so it’s not necessary to bring camping gear if you don’t want to. Be aware that there isn’t any electricity on-site so I recommend bringing solar powered torches/lanterns or headlamps if possible if planning on hiking around the island during the night time hours to see different animals like foxes who come out at night looking for food &amp; mates!</p>\n<p>The retreat offers workshops full of information about plant medicine &amp; dietas which I highly recommend doing before coming here if possible since they help you prepare for this journey prior to arrival! If not then there are plenty of workshops once here offered by experts in ayahuasca &amp; other plant medicines which will help provide answers &amp; healing for lots of people who are traveling here from all over the world!</p>\n<p>One thing I really liked about Casa Madrigal was the fact that they have a large number of volunteers who work hard everyday helping guests feel comfortable during their stay by providing them with lots of information about what they offer &amp; how things operate around here! This is important because it helps guests understand what is going on around them instead of being confused about what happens here during their stay which makes them feel more relaxed &amp; happy during their stay!</p>\n",
      "date_published": "2018-05-17T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Ubud/",
      "url": "https://heyletsgo.casa/posts/Lodge-Ubud/",
      "title": "Lodge Ubud",
      "content_html": "<p><img src=\"../../img/jungle/pexels-rachel-claire-5864237.jpg\" alt=\"Lodge Ubud\"></p>\n<p>Lodge Ubud is a magical lodge located in the heart of Ubud. It is a stunning accommodation that offers a wonderful range of amenities and services to ensure you have a memorable holiday. With Free Wi-Fi, on-site restaurant and bar, this property is perfect for unwinding and relaxing.</p>\n<p>A lovely hotel in the heart of Ubud within walking distance to all amenities, restaurants and shops. Very friendly, helpful staff. The breakfast was excellent with an extensive selection of Western and Indonesian food, including plenty of healthy options. Rooms are large with comfortable beds, lots of wardrobe space and good air conditioning. The pool is small but the view from the pool area is lovely overlooking Ricefields with nice gardens to wander around in. Highly recommended!</p>\n",
      "date_published": "2018-04-27T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Naladhu/",
      "url": "https://heyletsgo.casa/posts/Ranch-Naladhu/",
      "title": "Ranch Naladhu",
      "content_html": "<p><img src=\"../../img/plains/pexels-frans-van-heerden-631317.jpg\" alt=\"Ranch Naladhu\"></p>\n<p>Ranch Naladhu is a ecological ranch that aims to re-create the natural ecosystem, providing a sanctuary for wild animals and plants, while at the same time being a place where visitors can experience the richness of nature. The landscape is a unique blend of vegetation, water bodies and a variety of ecosystems.</p>\n<p>Ranch Naladhu is a unique eco-resort located in the midst of wildlife sanctuaries in Tamil Nadu. With its 12 acres of lush green forest and almost 400 species of birds, it is like an oasis in the desert.</p>\n",
      "date_published": "2018-04-15T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Paradise-Beach/",
      "url": "https://heyletsgo.casa/posts/Lodge-Paradise-Beach/",
      "title": "Lodge Paradise Beach",
      "content_html": "<p><img src=\"../../img/beach/pexels-quang-nguyen-vinh-3355735.jpg\" alt=\"Lodge Paradise Beach\"></p>\n<p>Lodge Paradise Beach is a jawdropping lodge on the island of Nusa Lembongan, a tiny island off the coast of Bali. The lodge has three villas and a gorgeous pool overlooking the ocean. There is a private dock for swimming and snorkeling, as well as a private beach for relaxing on a day that you don’t feel like going to the other side of the island.</p>\n<p>The three villas are each different from one another, but they all have an open air concept with an outdoor shower and breathtaking views. As if it couldn’t get any better, there is also a restaurant on site so you don’t have to wake up early to get breakfast or order room service – you can just enjoy it right there!</p>\n",
      "date_published": "2018-03-11T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Guest-House-Paradise-Beach/",
      "url": "https://heyletsgo.casa/posts/Guest-House-Paradise-Beach/",
      "title": "Guest House Paradise Beach",
      "content_html": "<p><img src=\"../../img/beach/pexels-michal-marek-3703521.jpg\" alt=\"Guest House Paradise Beach\"></p>\n<p>Guest House Paradise Beach is a romantic guest house built in the style of a Mediterranean villa, located right on the beach. It is situated in Yalikavak, just 10 km from Kusadasi. The guest house offers affordable accommodation with free WiFi, an outdoor swimming pool and free parking facilities.</p>\n<p>A TV with satellite channels is available in each room of the guest house. The rooms are very comfortable and have an en suite bathroom with hairdryer and shower facilities. Guests may enjoy a drink at the bar or relax at the terrace overlooking the sea.</p>\n<p>Guests can explore various activities around Yalikavak including windsurfing, water skiing, horse riding and fishing at Paradise Beach. There are also plenty of restaurants, bars and shops within walking distance from Yalikavak Guest House Paradise Beach. Izmir Adnan Menderes Airport is located 45 km away from the guest house.</p>\n",
      "date_published": "2018-03-01T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Paracas/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Paracas/",
      "title": "Ecolodge Paracas",
      "content_html": "<p><img src=\"../../img/plains/pexels-antony-trivet-6057042.jpg\" alt=\"Ecolodge Paracas\"></p>\n<p>Ecolodge Paracas is a breathtaking ecolodge that sits on a hill behind the Paracas National Reserve. It is a very special place that has been created by the Peruvian natives and the owners of Ecolodge Paracas, Romina and Pablo Campuzano.</p>\n<p>The vision of the Campuzano family is to create a sustainable eco retreat that offers its guest a unique opportunity to explore and experience nature in all its glory. The choice of location, the design of the ecolodge, and all of its facilities has been done with this goal in mind.</p>\n<p>The ecolodge is situated at around 800 meters above sea level with stunning views over the Pacific Ocean and coastline. The location also offers fantastic views over two neighboring mountain ranges; one is known as Cerro Colorado (the red mountain) and Cerro Paracas (the Paracas mountain). From this vantage point you can observe sea lions, marine iguanas, flamingos, birds and much more as they inhabit these protected beaches.</p>\n",
      "date_published": "2018-01-08T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Chateau-St-Pauls/",
      "url": "https://heyletsgo.casa/posts/Chateau-St-Pauls/",
      "title": "Chateau St Pauls",
      "content_html": "<p><img src=\"../../img/city/pexels-jimmy-chan-3236903.jpg\" alt=\"Chateau St Pauls\"></p>\n<p>Chateau St Pauls is a historical Chateau and estate in the commune of Miribel, in the Drôme département of France. The main Chateau was built during the 16th century and is listed as a &quot;monument historique&quot; by the French Ministry of Culture since 1922.</p>\n<p>The Chateau's history dates back to 1234, when the lands were granted as a fief to Guillaume de Miribel by Hugues des Arcis, Seigneur de Chateaurenard. The castle was enlarged during the 14th and 15th centuries and occupied by Gaston de Béarn, husband of Jeanne d'Auvergne (1429–1464), daughter of Paul III d'Auvergne (1390–1438), Seigneur de Miribel and Comte de Formigny. In 1454, Guillaume III d'Auvergne (1425–1488), son of Paul III, became owner of the Chateau and remained so until his death. In 1568, Anne d'Auvergne (d. 1584), daughter of Guillaume III sold the estate to her cousin Charles II d'Estaing who remained its owner until 1616. From 1616 onwards it remained a possession of the Béarn-Miribel family until it passed into the hands of Claude-Charles du Roy de Saint-Albin in 1780. His descendants owned it up to 1855 when it became property of Mr Léonard Jollivet Victorin who bequeathed it to his son Jean-Marie Jollivet Victorin who subsequently passed it on to his nephew Jacques du Roy d'Armenonville in 1912. The latter had no children and his widow sold Chateau St Pauls to Mr Lefebvre in 1967 who owned it until 2000 when he gifted it to a not for profit association called &quot;Les Amis du Chateau Saint-Paul&quot;. Since then restoration works have been undertaken with help from financial organisations such as FNAIM, Fondation du Patrimoine, Fondation pour la Nature et l’Homme (FNH) , Agence française pour le développement (AFD) et Eurorégion Rhône Alpes Auvergne - Val de Loire . It was at this time that an outbuilding which had been used as stables was restored to become an area for wine production by La Dilettante where they make their range of Cypriot wines (Anoussa Valley).</p>\n<p>Since 2003 two artists have lived on site at Chateau St Paul’s: Plasticien Yves Abecassis known for his monumental sculptures &amp; installations made from waste materials; he began working at CHSP in 2003 after meeting Mme la Comtesse Humbert du Roure; Artiste Christophe Jacquet also lives on site with his wife since 2005; both artists are Resident Artists at CHSP since 2013</p>\n",
      "date_published": "2017-11-13T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Sabi-Sands/",
      "url": "https://heyletsgo.casa/posts/Inn-Sabi-Sands/",
      "title": "Inn Sabi Sands",
      "content_html": "<p><img src=\"../../img/plains/pexels-pixabay-259411.jpg\" alt=\"Inn Sabi Sands\"></p>\n<p>Inn Sabi Sands is a ecological inn that is located in the Sabi Sands Game Reserve in South Africa. It has been built in such a way that it blends into the surroundings and does not affect the wildlife, either in appearance or with noise pollution. The Inn is designed for comfort and to enhance the guests’ safari experience by providing an opportunity for interaction with the wild animals right outside one’s bedroom door.</p>\n<p>The design of the Inn has taken into account factors like climate control, solar energy, water harvesting, natural ventilation and waste disposal, among others. The roof of the building is covered with glass panels which let light into the building during day time and also provide a view into the game reserve at night. Inside the rooms there are large windows that allow for views of animals on both sides of them; one side is towards their dens while other side looks out towards more open spaces.</p>\n<p>The rooms are all designed with different themes to give them character. Each has its own outdoor area where guests can relax or dine at leisure. The dining area is located near a waterhole so guests can watch animals drink while they enjoy their meal. There are also viewing decks around this area where guests can sit down to relax after a long day of game drives or simply watch the animals enjoy themselves without feeling like they are intruding on their privacy.</p>\n<p>Another interesting feature of this Inn is that it has its own ecological pest control system that helps keep pests under control without harming any of the local fauna or flora around it. The system works by attracting birds which feed on pests like tsetse flies and termites, thus keeping them under control without using any harmful chemicals or insecticides which could, otherwise affect other species living in these areas as well as pollute this pristine environment further.</p>\n",
      "date_published": "2017-07-15T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Ubud/",
      "url": "https://heyletsgo.casa/posts/Ranch-Ubud/",
      "title": "Ranch Ubud",
      "content_html": "<p><img src=\"../../img/jungle/pexels-renzy-atibagos-3377320.jpg\" alt=\"Ranch Ubud\"></p>\n<p>Ranch Ubud is a rustic ranch in the rice fields in the village of Ubud in Indonesia. The ranch was created by the Agung Rai Museum of Art (ARMA) and is situated inside ARMA's compound. The ranch is known for its art works and sculptures.</p>\n<p>The ARMA art complex consists of a museum, a gallery, an amphitheatre and a sculpture garden.</p>\n<p>In addition to displaying works from local artists, the Ranch also hosts exhibitions from international artists. Some of the exhibitions were held by renowned artists such as Michelangelo Pistoletto, Anish Kapoor, Damien Hirst and Jeff Koons.</p>\n",
      "date_published": "2017-06-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-Sant-Andrea/",
      "url": "https://heyletsgo.casa/posts/Suites-Sant-Andrea/",
      "title": "Suites Sant Andrea",
      "content_html": "<p><img src=\"../../img/city/pexels-ahmed-abdelaziz-453201.jpg\" alt=\"Suites Sant Andrea\"></p>\n<p>Suites Sant Andrea is a romantic suites situated in a beautiful old building, recently renovated. The rooms are furnished with antiques and the bookshelves are filled with a variety of interesting books. The garden is very nice and perfect for relaxing. It's situated in front of the castle of Urbino, so you can watch the tourists going up and down that steep road. There is a great restaurant just below the hotel, which serves excellent food. And there is also a bus stop just outside for exploring Urbino by public transportation. I would strongly recommend it to anyone looking for a place to stay in Urbino!</p>\n",
      "date_published": "2017-05-20T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Private-Island-Ocean-Sunset/",
      "url": "https://heyletsgo.casa/posts/Private-Island-Ocean-Sunset/",
      "title": "Private Island Ocean Sunset",
      "content_html": "<p><img src=\"../../img/beach/pexels-tom-fisk-4373238.jpg\" alt=\"Private Island Ocean Sunset\"></p>\n<p>Private Island Ocean Sunset is a rustic private island – a gem – nestled in the heart of the Gulf Islands National Park Reserve. The island is a place where you can truly unwind, reconnect with nature and enjoy a peaceful retreat!</p>\n<p>Lush forests, wildflowers, abundant wildlife and stunning ocean vistas await you. The island offers 15 private campsites dotted along trails through coastal forest, meadows and down to the shoreline.</p>\n<p>There are two freshwater lakes on the island – catch and cook your own fish or just relax by their waters. A short walk takes you to the tiny community of Islesford where there are wonderful restaurants, shops and an historical museum.</p>\n<p>The Great Blue Heron campground has flush toilets, cold water showers (summer only), fire pits (wood available for purchase) picnic tables and room for up to six tents. The campground is wheelchair accessible. There are no canoe rentals on the island but canoes or kayaks can be rented nearby (please bring your own lifejackets). Enjoy swimming in crystal clear water along the shady shores of the island; explore tidal pools; search for shells; read a book; nap in the shade or take a short hike through coastal forest or meadow to one of our stunning sandy beaches!</p>\n",
      "date_published": "2017-05-16T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ranch-Pacuare/",
      "url": "https://heyletsgo.casa/posts/Ranch-Pacuare/",
      "title": "Ranch Pacuare",
      "content_html": "<p><img src=\"../../img/jungle/pexels-jason-boyd-3209049.jpg\" alt=\"Ranch Pacuare\"></p>\n<p>Ranch Pacuare is a charming ranch located on the banks of the Pacuare River, only five minutes away from the entrance to the National Park. The ranch is made up of different cottages, each with its own charm and unique design. All are surrounded by palms, fruit trees, flowers and exotic plants.</p>\n<p>The ranch has many tourist attractions such as horseback rides on the river shores, boat trips through the rapids of the Pacuare River or into the national park, rafting trips to La Piedra waterfalls or into canals of Tortuga Island. The great variety of activities at Ranch Pacuare will delight visitors every time they visit!</p>\n",
      "date_published": "2017-04-20T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Resort-White-Pebble/",
      "url": "https://heyletsgo.casa/posts/Resort-White-Pebble/",
      "title": "Resort White Pebble",
      "content_html": "<p><img src=\"../../img/beach/pexels-asad-photo-maldives-240514.jpg\" alt=\"Resort White Pebble\"></p>\n<p>Resort White Pebble is a breathtaking resort featuring a palatial lobby, marble floors, breathtaking columns, and a high vaulted ceiling. It's one of the most prestigious hotels in Hua Hin. The rooms are spacious with nice views to the pool, the sea or garden. The pool is amazing with its stunning design it is surrounded by beautiful gardens. All rooms are equipped with air conditioners, satellite TV, safety deposit box, mini bar, coffee &amp; tea making facilities and private bathrooms with hot water. The hotel offers stunning sea views from all guestrooms</p>\n",
      "date_published": "2017-03-31T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-St-Pauls/",
      "url": "https://heyletsgo.casa/posts/Suites-St-Pauls/",
      "title": "Suites St Pauls",
      "content_html": "<p><img src=\"../../img/city/pexels-aleksandar-pasaric-3048538.jpg\" alt=\"Suites St Pauls\"></p>\n<p>Suites St Pauls is a gastronomical suites hotel in Vancouver, British Columbia. The hotel is located in the heart of Downtown Vancouver in proximity to shopping, dining and entertainment. Ample underground parking is available at no extra cost.</p>\n<p>Suites St Paul’s is located in the heart of downtown Vancouver at the corner of Hornby Street and Richards Street. The hotel features 186 suites ranging from 400 to 1,500 sq. ft., each with a separate living room, bedroom, kitchenette and en-suite bathroom.</p>\n<p>The hotel offers a wide selection of amenities including - meeting/conference facilities for up to 300 guests, fitness centre with state-of-the-art equipment, indoor swimming pool and sauna, two business centres, complimentary wireless Internet access throughout the hotel, 24-hour room service and more than 20 food outlets featuring gourmet cuisine.</p>\n<p>The hotel provides an ideal setting for business travellers wishing to be close to downtown businesses including law firms HSBC Canada Place (Cable Vision), BC Place Stadium (Rogers Centre) and BC Petroleum Conference Centre (Telus World).</p>\n",
      "date_published": "2017-03-12T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Camp-Ubud/",
      "url": "https://heyletsgo.casa/posts/Camp-Ubud/",
      "title": "Camp Ubud",
      "content_html": "<p><img src=\"../../img/jungle/pexels-arthouse-studio-4534200.jpg\" alt=\"Camp Ubud\"></p>\n<p>Camp Ubud is a breathtaking camp that offers privacy and intimacy in a peaceful environment. Here you will find a private pool and the open air cabana is perfect for lounging by the pool or just reading a book in privacy.</p>\n<p>The cabana also includes a large outdoor shower so you can rinse off after swimming or enjoying the hot tub.</p>\n<p>At Camp Ubud you have your own personal staff, including a chef who will create gourmet meals to suit your tastes. But, if you wish there are plenty of restaurants within a short walking distance of the camp.</p>\n<p>Inside the cabana, there is an open-air bedroom with four poster bed and mosquito net. The bathroom is on the other side of the room has an indoor/outdoor shower, sink and toilet with bidet. The outdoor area also has two day beds for relaxing on this secluded island among private pools set amidst lush vegetation.</p>\n<p>This island retreat features all-day activities that include fun water sports like kayaking, canoeing, windsurfing, snorkeling and diving. And don’t forget to take advantage of your personal chef who can prepare scrumptious meals using fresh ingredients which are available at your convenience on this private island resort like coconut milk, lemongrass, herbs and spices.</p>\n",
      "date_published": "2017-02-16T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-San-Ignacio/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-San-Ignacio/",
      "title": "Ecolodge San Ignacio",
      "content_html": "<p><img src=\"../../img/jungle/pexels-jason-boyd-3209049.jpg\" alt=\"Ecolodge San Ignacio\"></p>\n<p>Ecolodge San Ignacio is a magical ecolodge nestled in the jungle on the skirts of San Ignacio. The lodge is a great place to get away from the hustle and bustle of busy city life and enjoy nature at its best.</p>\n<p>The lodge is located on a large piece of land that includes an incredible swimming pool, a pool table, 2 restaurants/bars, hammocks and lounge chairs to relax in. The staff at the lodge are very friendly and nice! We booked our tours with them and they were very helpful with planning what we wanted to do during our stay.</p>\n<p>The rooms are very nice and clean. They have everything you need in the room, including a fridge for drinks, coffee maker, soap/shampoo/conditioner in a dispenser in each bathroom, towels and even toilet paper! The beds are very comfortable with mosquito nets over them so if you have any kind of insects in your room you can just close your net over you when you sleep at night! Each room has a terrace overlooking the beautiful grounds or jungle.</p>\n<p>We stayed in an “Eco” room which is located near the restaurant/bar area so we could watch TV when we wanted to but also be close if we wanted to go out for dinner or drinks. It is also away from most of the noise that happens by the pool/bar area during the day… perfect for napping! If that doesn’t work for you there are several other types of rooms available including suites with private plunge pools if that’s what you want!</p>\n<p>The food at Ecolodge San Ignacio was delicious!!! They have 2 restaurants on-site which serve breakfast (included) every morning from 8am-10am with lots of options from pancakes, omelets, breads, juices etc. Lunch is served from 12pm-2pm again with lots of options like chicken or fish dishes as well as salads or rice dishes etc., all delicious! Dinner was served between 7pm-10pm again with lots of different options like chili con carne (beef stew), chicken curry (YUMMY), shrimp fajitas etc… Everything was delicious!!! There is also popcorn available 24 hours a day if you get hungry between meals or want to snack before bedtime… it’s okay here they don’t mind!! 🙂 I can not say enough about how tasty everything was!!</p>\n",
      "date_published": "2016-10-06T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Inn-Gritti-Palace/",
      "url": "https://heyletsgo.casa/posts/Inn-Gritti-Palace/",
      "title": "Inn Gritti Palace",
      "content_html": "<p><img src=\"../../img/city/pexels-min-an-1006105.jpg\" alt=\"Inn Gritti Palace\"></p>\n<p>Inn Gritti Palace is a jawdropping inn that was built in the 1700s, and it’s been retained with its original furniture and decoration.</p>\n<p>For a more modern design, check out the Grand Hotel Europe. It has a mix of contemporary and old-fashioned decor, and it perfectly blends in with the surrounding area of Castello.</p>\n<p>If you’re looking for a 5-star hotel experience, check out the Bauer Il Palazzo. The hotel has two towers, and each one has its own character. It’s located right in front of Saint Mark’s Square, so you can get to all the major sights by foot easily.</p>\n<p>Finally, if you want to stay in a mansion that doesn’t have any modern features at all, check out Palazzo Contarini Pola. This palace was built in 1567 and is rich with historical details like ancient frescoes and marble floors. The building is surrounded by Venetian gardens where you can enjoy your morning coffee or an evening drink while getting away from the hustle and bustle of city life that surrounds you in Venice. You can even take an afternoon dip in the pool that overlooks Saint Mark’s Square!</p>\n",
      "date_published": "2016-10-02T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Victoria/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Victoria/",
      "title": "Hotel and Spa Victoria",
      "content_html": "<p><img src=\"../../img/city/pexels-andrew-neel-3201763.jpg\" alt=\"Hotel and Spa Victoria\"></p>\n<p>Hotel and Spa Victoria is a sophisticated Hotel and Spa in the centre of Palma, just a stone's throw away from all the main shops, bars and restaurants. The hotel has an outdoor swimming pool with direct access to the beach.</p>\n<p>This 4 star hotel is located in the city centre of Palma. The nearest airport is Mallorca Airport, 6 km from Hotel and Spa Victoria.</p>\n<p>Hotel and Spa Victoria features 83 rooms across 6 floors. Facilities include room service, a safe deposit box and a cloakroom.</p>\n<p>The on-site restaurant serves international cuisine for breakfast, lunch and dinner. There is also an in-house bar to relax in at the end of the day with a drink in hand. Guests can enjoy further dining options at the local bars and restaurants located in the immediate vicinity of this hotel.</p>\n<p>This property offers free parking for guests arriving by car. Guests can explore various recreational opportunities including golfing, horse riding and cycling when they are not relaxing in their rooms or spending time on one of the many sporting facilities available on site such as table tennis and basketball courts or visiting one of the nearby attractions like Museo de Mallorca (Palma de Mallorca). There are also 2 golf courses within 20 minutes' drive from Hotel and Spa Victoria: Son Vida Golf Club (Son Vida Golf Club) and Golf Son Antem (Golf Son Antem).</p>\n",
      "date_published": "2016-09-14T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Palace-Castille/",
      "url": "https://heyletsgo.casa/posts/Palace-Castille/",
      "title": "Palace Castille",
      "content_html": "<p><img src=\"../../img/city/pexels-lucas-pezeta-2352348.jpg\" alt=\"Palace Castille\"></p>\n<p>Palace Castille is a historical palace in the center of Madrid, Spain. It was a royal residence until the 19th century. The palace is located on Calle Bailén, in the district of Retiro, near Atocha railway station.</p>\n<p>Palacio Real de Aranjuez is a palace located in Aranjuez, Community of Madrid, Spain. It was one of the most important royal sites from the time of the Habsburgs and remains an active palace today.</p>\n<p>Plaza de Toros de Las Ventas is a bullring in Madrid, Spain near the Buen Retiro Park. It is one of the largest rings in Spain and one of four major rings in Madrid (the other three being Las Ventas, El Espartal and the Arena de Ovetense). It was inaugurated on September 27, 1928 with a bullfight by Alfonso XIII attended by over 20,000 people.</p>\n",
      "date_published": "2016-08-07T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Lodge-Osa-Peninsula/",
      "url": "https://heyletsgo.casa/posts/Lodge-Osa-Peninsula/",
      "title": "Lodge Osa Peninsula",
      "content_html": "<p><img src=\"../../img/jungle/pexels-evgenia-basyrova-5029310.jpg\" alt=\"Lodge Osa Peninsula\"></p>\n<p>Lodge Osa Peninsula is a rustic lodge on a small peninsula on the southern coast of Osa Peninsula in Costa Rica, overlooking the Golfo Dulce. The lodge has six rustic cabins set on a sloping lawn covered in tropical flowers with an excellent view of the gulf.</p>\n<p>Finca Rosa Blanca Coffee Plantation &amp; Inn Finca Rosa Blanca Coffee Plantation &amp; Inn is located on the SW foothills of the Talamanca Mountain range, within the Braulio Carillo National Park and Biological Reserve, which was established in 1979 and is home to more than 240 species of birds and animals, including Baird’s tapir, white-faced capuchin monkeys, red-tailed squirrels and many others.</p>\n<p>The Lodge at Los Guayabos The Lodge at Los Guayabos is located near one of Costa Rica’s most famous national parks – Corcovado National Park – one of the best places to view wildlife in all of Costa Rica. It has 5 luxury tented bungalows overlooking the ocean with ocean front bathrooms and private decks. Each bungalow can accommodate 2 to 4 people.</p>\n<p>Iguanazul Jardines del Rey Iguanazul Jardines del Rey is located on a private reserve just outside Corcovado National Park on the Osa Peninsula. The lodge consists of 4 individual villas that are built with natural materials such as rammed earth walls, thatched roofs and stone floors with leather walls. There are no roads or electricity at Iguanazul Jardines del Rey but there are well-maintained trails to all parts of this private reserve where guests can hike or ride horses to see monkeys, anteaters, coatis, agouti and howler monkeys during their visit.</p>\n",
      "date_published": "2016-06-22T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-and-Spa-Gritti-Palace/",
      "url": "https://heyletsgo.casa/posts/Hotel-and-Spa-Gritti-Palace/",
      "title": "Hotel and Spa Gritti Palace",
      "content_html": "<p><img src=\"../../img/city/pexels-jonathan-petersson-528427.jpg\" alt=\"Hotel and Spa Gritti Palace\"></p>\n<p>Hotel and Spa Gritti Palace is a romantic Hotel and Spa tucked away in the heart of Venice, overlooking the Grand Canal. We offer our guests a range of luxury accommodation and suites, a selection of spa treatments and a Michelin-starred restaurant. The hotel is housed in a building originally built in 1340 and has been home to some of Venice’s most famous residents, including Napoleon Bonaparte. Rewarding your senses with its stunning interiors, elegant furniture and full-height windows overlooking the Grand Canal, Hotel and Spa Gritti Palace will charm you from the moment you arrive. Guests are welcomed into an elegant entrance hall before being ushered into one of our luxurious suites. The offerings at Gritti Palace include the finest Italian handmade beds - made exclusively for us at &quot;Cappello&quot; - soft fabrics from Frette linen, custom-made Murano glass lighting, Murano glass chandeliers by Venini and furniture by Mazzega. Our rooms have been individually designed to reflect their unique location within this historic palace ensuring views are breathtaking no matter which room you choose. Our spacious bathrooms are all fitted with LVM Nove’ fixtures including freestanding baths, dual head shower cubicles with massage jets, freestanding basins with polished stone tops and heated towel rails. Our suites feature private terraces or balconies offering views across Venice’s Grand Canal or over the rooftops of the city to St Mark's Basilica or Giudecca Island. Our guest rooms also boast state-of-the-art entertainment facilities including 42&quot; LCD TVs with Blu-ray players and iPod docking stations which can be controlled by an iPad app available for download free of charge on your mobile device. The hotel’s charming restaurant is run by international luxury chef Daniel Humm who heads up his own team of culinary experts in order to create menus inspired by Venetian cuisine using only seasonal produce sourced locally when possible although ingredients imported from around the world are often used when necessary for preservation purposes or due to tradition or demand in particular areas such as seafood or game meat. Dining in Venice is an experience like no other; dining in Hotel and Spa Gritti Palace is no exception!</p>\n",
      "date_published": "2016-06-04T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Ecolodge-Osa-Peninsula/",
      "url": "https://heyletsgo.casa/posts/Ecolodge-Osa-Peninsula/",
      "title": "Ecolodge Osa Peninsula",
      "content_html": "<p><img src=\"../../img/jungle/pexels-james-wheeler-1534057.jpg\" alt=\"Ecolodge Osa Peninsula\"></p>\n<p>Ecolodge Osa Peninsula is a rustic ecolodge on the Osa Peninsula. You can come here for a day or spend a few days and stay in one of the rustic cabins (some with bathrooms and some without), and enjoy hiking and wildlife viewing in the forest.</p>\n<p>This is an excellent way to experience the forest and wildlife of Costa Rica. The lodge is near Punta Mona, which is a black sand beach that is great for swimming, snorkeling, and surfing (depending on ocean conditions).</p>\n",
      "date_published": "2016-05-19T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Hotel-Cipriani/",
      "url": "https://heyletsgo.casa/posts/Hotel-Cipriani/",
      "title": "Hotel Cipriani",
      "content_html": "<p><img src=\"../../img/city/pexels-ahmed-abdelaziz-453201.jpg\" alt=\"Hotel Cipriani\"></p>\n<p>Hotel Cipriani is a jawdropping hotel right on Piazza San Marco. It's luxurious, but not overly so. The breakfast buffet is worth the price of admission ($38/person), and the rooms are stunningly decorated.</p>\n<p>Where to Eat in Venice</p>\n<p>Venice has an abundance of local restaurants that are generally reasonably priced. However, there are also a few highly regarded &quot;must-try&quot; restaurants that are worth mentioning. These restaurants tend to be more expensive, but they're special for a reason, and you won't regret trying them at least once.</p>\n<p>Osteria La Caravella is one of my all-time favorite restaurants in the world. Located right on Campo Santa Margherita near Campo San Barnaba, La Caravella is one of the most well-known osterias in all of Italy. The food is ridiculously fresh and generally served family style (which makes it easy to share), and you can't beat that view! I have never had a bad meal here, and I have no doubt that this will continue to be my go-to place when I visit Venice in the future. Note: They do not take reservations, so only go if you're okay with waiting for a table! It's worth it though!</p>\n<p>Osteria Enoteca Ai Artisti is another great option for eating out in Venice. It's located near Il Redentore church on Isola di San Michele (which was where we stayed during our trip). This osteria has lovely outdoor seating right on the water as well as indoor seating with traditional Venetian decor inside (including an old piano). The prices aren't too bad either – expect to spend around $20/person for lunch or dinner here (and $35/person for brunch). They do not take reservations so be prepared to wait if you want an outdoor table or come early if you want an indoor table – we waited less than half an hour both times we went there, and we ate late afternoon both times which is typically when many people eat lunch in Venice anyway! Highly recommend this restaurant – it's one of our favorites from our entire trip!</p>\n<p>La Cantina della Birra Artusi is perhaps the most famous restaurant in all of Venice (at least according to TripAdvisor!) Located right on Campo Santa Margherita near Campo San Barnaba, Birra Artusi's claim to fame comes from its beer selection – they brew their own beer using sourdough yeast and serve it alongside traditional Italian food like risotto and handmade pasta that comes straight from their own kitchen (they don't use any pre-made sauces or pastas here). If you're looking for something simple like pizza or pasta though, Birra Artusi probably isn't your best bet since they specialize in more high-end traditional Italian dishes – but it's definitely a must-try if you want to try some local beers while visiting Venice! Note: You can also buy Birra Artusi beers from many other bars throughout Venice too – including at most bars right around Rialto Bridge which makes this restaurant a great stop after doing some sightseeing there! Also note: This restaurant can get quite busy during peak tourist season which means it may take a while before they can seat you – just look at them &amp; smile though since they always seem happy anyway!</p>\n",
      "date_published": "2016-04-21T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Palace-Providence/",
      "url": "https://heyletsgo.casa/posts/Palace-Providence/",
      "title": "Palace Providence",
      "content_html": "<p><img src=\"../../img/city/pexels-konstantinos-eleftheriadis-2034335.jpg\" alt=\"Palace Providence\"></p>\n<p>Palace Providence is a jawdropping palace hotel that is located in the heart of the city. The place is home to a pool, a casino, a hot tub, and many other activities. It's also known for hosting many high-profile celebrities and performers.</p>\n<p>In addition to all of these things, it's also a great place to stay if you want to be close to the city center. You can easily walk or take a bus there from this hotel.</p>\n<p>Stay at this hotel if you want the best location, the best amenities, and a price that won't break your bank account.</p>\n",
      "date_published": "2016-04-09T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Resort-Sunset-Dream/",
      "url": "https://heyletsgo.casa/posts/Resort-Sunset-Dream/",
      "title": "Resort Sunset Dream",
      "content_html": "<p><img src=\"../../img/beach/pexels-asad-photo-maldives-3155661.jpg\" alt=\"Resort Sunset Dream\"></p>\n<p>Resort Sunset Dream is a breathtaking resort located on the mountainous area of Khao Yai National Park, only 1 hour away from Bangkok. The resort features a panoramic view of Khao Yai, Thailand's largest national park.</p>\n<p>The design of the resort aims to create a harmony between nature and modern architecture, to provide our guests with an unforgettable experience for their holiday.</p>\n<p>Immerse yourself in the beautiful lush greenery of the mountain, enjoy your private balcony overlooking the serenity of nature and relish your time away from home to relax or explore what Khao Yai has to offer.</p>\n<p>The rooms are spacious with traditional Thai furniture decorating them, you will feel at home as soon as you step in. There are also two types of pool villa that you can choose from - pool villa with garden view or pool villa with mountain view. Pool villas feature private swimming pools and outdoor seating areas to ensure that your stay is extra comfortable.</p>\n",
      "date_published": "2016-02-06T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Safari-Camp-San-Ignacio/",
      "url": "https://heyletsgo.casa/posts/Safari-Camp-San-Ignacio/",
      "title": "Safari Camp San Ignacio",
      "content_html": "<p><img src=\"../../img/jungle/pexels-jacob-colvin-1757363.jpg\" alt=\"Safari Camp San Ignacio\"></p>\n<p>Safari Camp San Ignacio is a romantic safari camp located in the Nairobi Safari Conservancy.</p>\n<p>The camp is located in the middle of the Nairobi National Park and has a wonderful panoramic view on the Great Rift Valley and Mount Kilimanjaro. The camp has eight tents and all suites have a private veranda with views of spectacular scenery.</p>\n",
      "date_published": "2016-01-29T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Suites-Ocean-View/",
      "url": "https://heyletsgo.casa/posts/Suites-Ocean-View/",
      "title": "Suites Ocean View",
      "content_html": "<p><img src=\"../../img/beach/pexels-jess-loiterton-5006981.jpg\" alt=\"Suites Ocean View\"></p>\n<p>Suites Ocean View is a magical suites resort in Cancun Mexico. The rooms are located by the beach and have a wonderful view of the ocean.</p>\n<p>The service at the hotel is excellent, the staff is very professional and friendly. The hotel offers a variety of restaurants, bars and swimming pools to enjoy your stay in Cancun Mexico.</p>\n",
      "date_published": "2016-01-11T00:00:00-00:00"
    },{
      "id": "https://heyletsgo.casa/posts/Guest-House-Ocean-Sunset/",
      "url": "https://heyletsgo.casa/posts/Guest-House-Ocean-Sunset/",
      "title": "Guest House Ocean Sunset",
      "content_html": "<p><img src=\"../../img/beach/pexels-jess-loiterton-5006981.jpg\" alt=\"Guest House Ocean Sunset\"></p>\n<p>Guest House Ocean Sunset is a upscale guest house with 4 rooms, 2 double rooms and 2 single rooms, which are all with their own bathroom, quite and clean environment. Our guest house is within 10 - 15 minutes walk to the beautiful beach of Hoi An.</p>\n<p>It's a two storey building with three bedrooms on the second floor, clothes storage area on the ground floor. The living room with air conditioning is on the ground floor with TV set.</p>\n<p>The guest house is located within 10 - 15 minutes walking distance to the center of Hoi An old town. It's also close to central market where you can find anything at any time of day or night. You can easily explore Hoi An by foot or bicycle.</p>\n",
      "date_published": "2015-10-31T00:00:00-00:00"
    }
  ]
}
